GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfsdev.c
/****************************************************************************
 * arch/arm/src/gd32e11x/gd32e11x_usbfsdev.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/param.h>
#include <sys/types.h>
#include <inttypes.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/kmalloc.h>
#include <nuttx/usb/usb.h>
#include <nuttx/usb/usbdev.h>
#include <nuttx/usb/usbdev_trace.h>

#include <nuttx/irq.h>
#include <arch/board/board.h>

#include "gd32e11x.h"
#include "gd32e11x_usbfs.h"

#if defined(CONFIG_USBDEV) && (defined(CONFIG_GD32E11X_USBFS))

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

/* USBFS 48MHz clock prescaler selection based on SYSCLK frequency */

#if (GD32_SYSCLK_FREQUENCY == 48000000)
#  define GD32_USBFSPSC_VALUE  RCU_CFG0_USBFSPSC_DIV1
#elif (GD32_SYSCLK_FREQUENCY == 72000000)
#  define GD32_USBFSPSC_VALUE  RCU_CFG0_USBFSPSC_DIV1_5
#elif (GD32_SYSCLK_FREQUENCY == 96000000)
#  define GD32_USBFSPSC_VALUE  RCU_CFG0_USBFSPSC_DIV2
#elif (GD32_SYSCLK_FREQUENCY == 120000000)
#  define GD32_USBFSPSC_VALUE  RCU_CFG0_USBFSPSC_DIV2_5
#else
#  error "Unsupported GD32_SYSCLK_FREQUENCY for USBFS 48MHz clock"
#endif

#ifndef CONFIG_USBDEV_EP0_MAXSIZE
#  define CONFIG_USBDEV_EP0_MAXSIZE 64
#endif

#ifndef CONFIG_USBDEV_SETUP_MAXDATASIZE
#  define CONFIG_USBDEV_SETUP_MAXDATASIZE CONFIG_USBDEV_EP0_MAXSIZE
#endif

#ifndef CONFIG_USBDEV_MAXPOWER
#  define CONFIG_USBDEV_MAXPOWER 100  /* mA */
#endif

/* There is 1.25Kb of FIFO memory.  The default partitions this memory
 * so that there is a TxFIFO allocated for each endpoint and with more
 * memory provided for the common RxFIFO.  A more knowledge-able
 * configuration would not allocate any TxFIFO space to OUT endpoints.
 */

#ifndef CONFIG_USBDEV_RXFIFO_SIZE
#  define CONFIG_USBDEV_RXFIFO_SIZE 512
#endif

#ifndef CONFIG_USBDEV_EP0_TXFIFO_SIZE
#  define CONFIG_USBDEV_EP0_TXFIFO_SIZE 128
#endif

#ifndef CONFIG_USBDEV_EP1_TXFIFO_SIZE
#  define CONFIG_USBDEV_EP1_TXFIFO_SIZE 128
#endif

#ifndef CONFIG_USBDEV_EP2_TXFIFO_SIZE
#  define CONFIG_USBDEV_EP2_TXFIFO_SIZE 128
#endif

#ifndef CONFIG_USBDEV_EP3_TXFIFO_SIZE
#  define CONFIG_USBDEV_EP3_TXFIFO_SIZE 128
#endif

/* Adjust actual number of endpoints based upon size;
 * 0 means 'not available', and we expect that the first 0-length endpoint
 * implies that all others after are unused as well (irrespective of what
 * their size is set to be).
 */

#if CONFIG_USBDEV_EP1_TXFIFO_SIZE == 0
#  undef GD32_NENDPOINTS
#  define GD32_NENDPOINTS 1
#  undef CONFIG_USBDEV_EP2_TXFIFO_SIZE
#  define CONFIG_USBDEV_EP2_TXFIFO_SIZE 0
#  undef CONFIG_USBDEV_EP3_TXFIFO_SIZE
#  define CONFIG_USBDEV_EP3_TXFIFO_SIZE 0
#elif CONFIG_USBDEV_EP2_TXFIFO_SIZE == 0
#  undef GD32_NENDPOINTS
#  define GD32_NENDPOINTS 2
#  undef CONFIG_USBDEV_EP3_TXFIFO_SIZE
#  define CONFIG_USBDEV_EP3_TXFIFO_SIZE 0
#elif CONFIG_USBDEV_EP3_TXFIFO_SIZE == 0
#  undef GD32_NENDPOINTS
#  define GD32_NENDPOINTS 3
#endif

/* Sanity check on allocations specified. */

#if (CONFIG_USBDEV_RXFIFO_SIZE + CONFIG_USBDEV_EP0_TXFIFO_SIZE + \
  CONFIG_USBDEV_EP1_TXFIFO_SIZE + CONFIG_USBDEV_EP2_TXFIFO_SIZE + \
  CONFIG_USBDEV_EP3_TXFIFO_SIZE) > 1280
#  error "FIFO allocations exceed FIFO memory size"
#endif

/* The actual FIFO addresses that we use must be aligned to 4-byte
 * boundaries; FIFO sizes must be provided in units of 32-bit words.
 */

#define GD32_RXFIFO_BYTES     ((CONFIG_USBDEV_RXFIFO_SIZE + 3) & ~3)
#define GD32_RXFIFO_WORDS     ((CONFIG_USBDEV_RXFIFO_SIZE + 3) >> 2)

#define GD32_EP0_TXFIFO_BYTES ((CONFIG_USBDEV_EP0_TXFIFO_SIZE + 3) & ~3)
#define GD32_EP0_TXFIFO_WORDS ((CONFIG_USBDEV_EP0_TXFIFO_SIZE + 3) >> 2)

#if GD32_EP0_TXFIFO_WORDS < 16 || GD32_EP0_TXFIFO_WORDS > 256
#  error "CONFIG_USBDEV_EP0_TXFIFO_SIZE is out of range"
#endif

#define GD32_EP1_TXFIFO_BYTES ((CONFIG_USBDEV_EP1_TXFIFO_SIZE + 3) & ~3)
#define GD32_EP1_TXFIFO_WORDS ((CONFIG_USBDEV_EP1_TXFIFO_SIZE + 3) >> 2)

#if GD32_EP1_TXFIFO_BYTES != 0 && GD32_EP1_TXFIFO_WORDS < 16
#  error "CONFIG_USBDEV_EP1_TXFIFO_SIZE is out of range"
#endif

#define GD32_EP2_TXFIFO_BYTES ((CONFIG_USBDEV_EP2_TXFIFO_SIZE + 3) & ~3)
#define GD32_EP2_TXFIFO_WORDS ((CONFIG_USBDEV_EP2_TXFIFO_SIZE + 3) >> 2)

#if GD32_EP2_TXFIFO_BYTES != 0 && GD32_EP2_TXFIFO_WORDS < 16
#  error "CONFIG_USBDEV_EP2_TXFIFO_SIZE is out of range"
#endif

#define GD32_EP3_TXFIFO_BYTES ((CONFIG_USBDEV_EP3_TXFIFO_SIZE + 3) & ~3)
#define GD32_EP3_TXFIFO_WORDS ((CONFIG_USBDEV_EP3_TXFIFO_SIZE + 3) >> 2)

#if GD32_EP3_TXFIFO_BYTES != 0 && GD32_EP3_TXFIFO_WORDS < 16
#  error "CONFIG_USBDEV_EP3_TXFIFO_SIZE is out of range"
#endif

#define USBFS_GINTF_RESERVED (USBFS_GINTF_RES89 | \
                              USBFS_GINTF_RES1617 | \
                              USBFS_GINTF_RES22)

#define USBFS_GINTF_RC_W1    (USBFS_GINTF_MFIF | \
                              USBFS_GINTF_SOF | \
                              USBFS_GINTF_ESP | \
                              USBFS_GINTF_SP | \
                              USBFS_GINTF_RST | \
                              USBFS_GINTF_ENUMF | \
                              USBFS_GINTF_ISOOPDIF | \
                              USBFS_GINTF_EOPFIF | \
                              USBFS_GINTF_ISOINCIF | \
                              USBFS_GINTF_PXNCIF_ISOONCIF | \
                              USBFS_GINTF_IDPSC | \
                              USBFS_GINTF_DISCIF | \
                              USBFS_GINTF_SESIF | \
                              USBFS_GINTF_WKUPIF)

/* Debug ********************************************************************/

