GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfsdev.c
/* Trace error codes */

#define GD32_TRACEERR_ALLOCFAIL            0x01
#define GD32_TRACEERR_BADCLEARFEATURE      0x02
#define GD32_TRACEERR_BADDEVGETSTATUS      0x03
#define GD32_TRACEERR_BADEPNO              0x04
#define GD32_TRACEERR_BADEPGETSTATUS       0x05
#define GD32_TRACEERR_BADGETCONFIG         0x06
#define GD32_TRACEERR_BADGETSETDESC        0x07
#define GD32_TRACEERR_BADGETSTATUS         0x08
#define GD32_TRACEERR_BADSETADDRESS        0x09
#define GD32_TRACEERR_BADSETCONFIG         0x0a
#define GD32_TRACEERR_BADSETFEATURE        0x0b
#define GD32_TRACEERR_BADTESTMODE          0x0c
#define GD32_TRACEERR_BINDFAILED           0x0d
#define GD32_TRACEERR_DISPATCHSTALL        0x0e
#define GD32_TRACEERR_DRIVER               0x0f
#define GD32_TRACEERR_DRIVERREGISTERED     0x10
#define GD32_TRACEERR_EP0NOSETUP           0x11
#define GD32_TRACEERR_EP0SETUPSTALLED      0x12
#define GD32_TRACEERR_EPINNULLPACKET       0x13
#define GD32_TRACEERR_EPINUNEXPECTED       0x14
#define GD32_TRACEERR_EPOUTNULLPACKET      0x15
#define GD32_TRACEERR_EPOUTUNEXPECTED      0x16
#define GD32_TRACEERR_INVALIDCTRLREQ       0x17
#define GD32_TRACEERR_INVALIDPARMS         0x18
#define GD32_TRACEERR_IRQREGISTRATION      0x19
#define GD32_TRACEERR_NOEP                 0x1a
#define GD32_TRACEERR_NOTCONFIGURED        0x1b
#define GD32_TRACEERR_EPOUTQEMPTY          0x1c
#define GD32_TRACEERR_EPINREQEMPTY         0x1d
#define GD32_TRACEERR_NOOUTSETUP           0x1e
#define GD32_TRACEERR_POLLTIMEOUT          0x1f

/* Trace interrupt codes */

#define GD32_TRACEINTID_USB                1       /* USB Interrupt entry/exit */
#define GD32_TRACEINTID_INTPENDING         2       /* On each pass through the loop */

#define GD32_TRACEINTID_EPOUT              (10 + 0) /* First level interrupt decode */
#define GD32_TRACEINTID_EPIN               (10 + 1)
#define GD32_TRACEINTID_MISMATCH           (10 + 2)
#define GD32_TRACEINTID_WAKEUP             (10 + 3)
#define GD32_TRACEINTID_SUSPEND            (10 + 4)
#define GD32_TRACEINTID_SOF                (10 + 5)
#define GD32_TRACEINTID_RXFIFO             (10 + 6)
#define GD32_TRACEINTID_DEVRESET           (10 + 7)
#define GD32_TRACEINTID_ENUMDNE            (10 + 8)
#define GD32_TRACEINTID_IISOIXFR           (10 + 9)
#define GD32_TRACEINTID_IISOOXFR           (10 + 10)
#define GD32_TRACEINTID_SRQ                (10 + 11)
#define GD32_TRACEINTID_OTG                (10 + 12)

#define GD32_TRACEINTID_EPOUT_XFRC         (40 + 0) /* EPOUT second level decode */
#define GD32_TRACEINTID_EPOUT_EPDISD       (40 + 1)
#define GD32_TRACEINTID_EPOUT_SETUP        (40 + 2)
#define GD32_TRACEINTID_DISPATCH           (40 + 3)

#define GD32_TRACEINTID_GETSTATUS          (50 + 0) /* EPOUT third level decode */
#define GD32_TRACEINTID_EPGETSTATUS        (50 + 1)
#define GD32_TRACEINTID_DEVGETSTATUS       (50 + 2)
#define GD32_TRACEINTID_IFGETSTATUS        (50 + 3)
#define GD32_TRACEINTID_CLEARFEATURE       (50 + 4)
#define GD32_TRACEINTID_SETFEATURE         (50 + 5)
#define GD32_TRACEINTID_SETADDRESS         (50 + 6)
#define GD32_TRACEINTID_GETSETDESC         (50 + 7)
#define GD32_TRACEINTID_GETCONFIG          (50 + 8)
#define GD32_TRACEINTID_SETCONFIG          (50 + 9)
#define GD32_TRACEINTID_GETSETIF           (50 + 10)
#define GD32_TRACEINTID_SYNCHFRAME         (50 + 11)

#define GD32_TRACEINTID_EPIN_XFRC          (70 + 0) /* EPIN second level decode */
#define GD32_TRACEINTID_EPIN_TOC           (70 + 1)
#define GD32_TRACEINTID_EPIN_ITTXFE        (70 + 2)
#define GD32_TRACEINTID_EPIN_EPDISD        (70 + 3)
#define GD32_TRACEINTID_EPIN_TXFE          (70 + 4)

#define GD32_TRACEINTID_EPIN_EMPWAIT       (80 + 0) /* EPIN second level decode */

#define GD32_TRACEINTID_OUTNAK             (90 + 0) /* RXFLVL second level decode */
#define GD32_TRACEINTID_OUTRECVD           (90 + 1)
#define GD32_TRACEINTID_OUTDONE            (90 + 2)
#define GD32_TRACEINTID_SETUPDONE          (90 + 3)
#define GD32_TRACEINTID_SETUPRECVD         (90 + 4)

/* Endpoints ****************************************************************/

/* Odd physical endpoint numbers are IN; even are OUT */

#define GD32_EPPHYIN2LOG(epphy)     ((uint8_t)(epphy)|USB_DIR_IN)
#define GD32_EPPHYOUT2LOG(epphy)    ((uint8_t)(epphy)|USB_DIR_OUT)

/* Endpoint 0 */

#define EP0                            (0)

/* The set of all endpoints available to the class implementation (1-n).
 * This is a bitmap, and the first endpoint (0) is reserved.
 */

#define GD32_EP_AVAILABLE           (((1 << GD32_NENDPOINTS) - 1) & ~1)

/* Maximum packet sizes for full speed endpoints */

#define GD32_MAXPACKET              (64)         /* Max packet size (1-64) */

/* Delays *******************************************************************/

#define GD32_READY_DELAY            200000
#define GD32_FLUSH_DELAY            200000

/* Request queue operations *************************************************/

#define gd32_rqempty(ep)            ((ep)->head == NULL)
#define gd32_rqpeek(ep)             ((ep)->head)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* Overall device state */

enum gd32_devstate_e
{
  DEVSTATE_DEFAULT = 0,    /* Power-up, unconfigured state.  This state simply
                            * means that the device is not yet been given an
                            * address.
                            *   SET:    At initialization, uninitialization,
                            *           reset, and whenever the device address
                            *           is set to zero
                            *   TESTED: Never
                            */
  DEVSTATE_ADDRESSED,      /* Device address has been assigned, not no
                            * configuration has yet been selected.
                            *   SET:    When either a non-zero device address
                            *           is first assigned or when the device
                            *           is unconfigured (with configuration == 0)
                            *   TESTED: never
                            */
  DEVSTATE_CONFIGURED,     /* Address assigned and configured:
                            *   SET:    When the device has been addressed and
                            *           an non-zero configuration has been selected.
                            *   TESTED: In many places to assure that the USB device
                            *           has been properly configured by the host.
                            */
};

/* Endpoint 0 states */

