GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfsdev.c
enum gd32_ep0state_e
{
  EP0STATE_IDLE = 0,       /* Idle State, leave on receiving a SETUP packet or
                            * epsubmit:
                            *   SET:    In gd32_epin() and gd32_epout() when
                            *           we revert from request processing to
                            *           SETUP processing.
                            *   TESTED: Never
                            */
  EP0STATE_SETUP_OUT,      /* OUT SETUP packet received.  Waiting for the DATA
                            * OUT phase of SETUP Packet to complete before
                            * processing a SETUP command (without a USB request):
                            *   SET:    Set in gd32_rxinterrupt() when SETUP OUT
                            *           packet is received.
                            *   TESTED: In gd32_ep0out_receive()
                            */
  EP0STATE_SETUP_READY,    /* IN SETUP packet received -OR- OUT SETUP packet and
                            * accompanying data have been received.  Processing
                            * of SETUP command will happen soon.
                            *   SET:    (1) gd32_ep0out_receive() when the OUT
                            *           SETUP data phase completes, or (2)
                            *           gd32_rxinterrupt() when an IN SETUP is
                            *           packet received.
                            *   TESTED: Tested in gd32_epout_interrupt() when
                            *           SETUP phase is done to see if the SETUP
                            *           command is ready to be processed.  Also
                            *           tested in gd32_ep0out_setup() just to
                            *           double-check that we have a SETUP request
                            *           and any accompanying data.
                            */
  EP0STATE_SETUP_PROCESS,  /* SETUP Packet is being processed by gd32_ep0out_setup():
                            *   SET:    When SETUP packet received in EP0 OUT
                            *   TESTED: Never
                            */
  EP0STATE_SETUPRESPONSE,  /* Short SETUP response write (without a USB request):
                            *   SET:    When SETUP response is sent by
                            *           gd32_ep0in_setupresponse()
                            *   TESTED: Never
                            */
  EP0STATE_DATA_IN,        /* Waiting for data out stage (with a USB request):
                            *   SET:    In gd32_epin_request() when a write
                            *           request is processed on EP0.
                            *   TESTED: In gd32_epin() to see if we should
                            *           revert to SETUP processing.
                            */
  EP0STATE_DATA_OUT        /* Waiting for data in phase to complete ( with a
                            * USB request)
                            *   SET:    In gd32_epout_request() when a read
                            *           request is processed on EP0.
                            *   TESTED: In gd32_epout() to see if we should
                            *           revert to SETUP processing
                            */
};

/* Parsed control request */

struct gd32_ctrlreq_s
{
  uint8_t  type;
  uint8_t  req;
  uint16_t value;
  uint16_t index;
  uint16_t len;
};

/* A container for a request so that the request may be retained in a list */

struct gd32_req_s
{
  struct usbdev_req_s      req;           /* Standard USB request */
  struct gd32_req_s       *flink;         /* Supports a singly linked list */
};

/* This is the internal representation of an endpoint */

struct gd32_ep_s
{
  /* Common endpoint fields.  This must be the first thing defined in the
   * structure so that it is possible to simply cast from struct usbdev_ep_s
   * to struct gd32_ep_s.
   */

  struct usbdev_ep_s       ep;            /* Standard endpoint structure */

  /* GD32E11x-specific fields */

  struct gd32_usbdev_s *dev;           /* Reference to private driver data */
  struct gd32_req_s    *head;          /* Request list for this endpoint */
  struct gd32_req_s    *tail;
  uint8_t                  epphy;         /* Physical EP address */
  uint8_t                  eptype:2;      /* Endpoint type */
  uint8_t                  active:1;      /* 1: A request is being processed */
  uint8_t                  stalled:1;     /* 1: Endpoint is stalled */
  uint8_t                  isin:1;        /* 1: IN Endpoint */
  uint8_t                  odd:1;         /* 1: Odd frame */
  uint8_t                  zlp:1;         /* 1: Transmit a zero-length-packet (IN EPs only) */
};

/* This structure retains the state of the USB device controller */

struct gd32_usbdev_s
{
  /* Common device fields.  This must be the first thing defined in the
   * structure so that it is possible to simply cast from struct usbdev_s
   * to struct gd32_usbdev_s.
   */

  struct usbdev_s          usbdev;

  /* The bound device class driver */

  struct usbdevclass_driver_s *driver;

  /* GD32E11x-specific fields */

  uint8_t                  stalled:1;     /* 1: Protocol stalled */
  uint8_t                  selfpowered:1; /* 1: Device is self powered */
  uint8_t                  addressed:1;   /* 1: Peripheral address has been set */
  uint8_t                  configured:1;  /* 1: Class driver has been configured */
  uint8_t                  wakeup:1;      /* 1: Device remote wake-up */
  uint8_t                  dotest:1;      /* 1: Test mode selected */

  uint8_t                  devstate:4;    /* See enum gd32_devstate_e */
  uint8_t                  ep0state:4;    /* See enum gd32_ep0state_e */
  uint8_t                  testmode:4;    /* Selected test mode */
  uint8_t                  epavail[2];    /* Bitset of available OUT/IN endpoints */

  /* E0 SETUP data buffering.
   *
   * ctrlreq:
   *   The 8-byte SETUP request is received on the EP0 OUT endpoint and is
   *   saved.
   *
   * ep0data
   *   For OUT SETUP requests, the SETUP data phase must also complete before
   *   the SETUP command can be processed.  The pack receipt logic will save
   *   the accompanying EP0 IN data in ep0data[] before the SETUP command is
   *   processed.
   *
   *   For IN SETUP requests, the DATA phase will occur AFTER the SETUP
   *   control request is processed.  In that case, ep0data[] may be used as
   *   the response buffer.
   *
   * ep0datlen
   *   Length of OUT DATA received in ep0data[] (Not used with IN data)
   */

  struct usb_ctrlreq_s     ctrlreq;
  uint8_t                  ep0data[CONFIG_USBDEV_SETUP_MAXDATASIZE];
  uint16_t                 ep0datlen;

  /* The endpoint lists */

  struct gd32_ep_s      epin[GD32_NENDPOINTS];
  struct gd32_ep_s      epout[GD32_NENDPOINTS];
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

