GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfsdev.c
/* Register operations ******************************************************/

#if defined(CONFIG_GD32E11X_USBDEV_REGDEBUG) && defined(CONFIG_DEBUG_FEATURES)
static uint32_t    gd32_getreg(uint32_t addr);
static void        gd32_putreg(uint32_t val, uint32_t addr);
#else
#  define gd32_getreg(addr)     getreg32(addr)
#  define gd32_putreg(val,addr) putreg32(val,addr)
#endif

/* Request queue operations *************************************************/

static struct
gd32_req_s *gd32_req_remfirst(struct gd32_ep_s *privep);
static bool       gd32_req_addlast(struct gd32_ep_s *privep,
                                      struct gd32_req_s *req);

/* Low level data transfers and request operations **************************/

/* Special endpoint 0 data transfer logic */

static
void gd32_ep0in_setupresponse(struct gd32_usbdev_s *priv,
                            uint8_t *data, uint32_t nbytes);
static inline
void gd32_ep0in_transmitzlp(struct gd32_usbdev_s *priv);
static void        gd32_ep0in_activate(void);

static
void gd32_ep0out_ctrlsetup(struct gd32_usbdev_s *priv);

/* IN request and TxFIFO handling */

static void        gd32_txfifo_write(struct gd32_ep_s *privep,
                     uint8_t *buf, int nbytes);
static void        gd32_epin_transfer(struct gd32_ep_s *privep,
                     uint8_t *buf, int nbytes);
static void        gd32_epin_request(struct gd32_usbdev_s *priv,
                     struct gd32_ep_s *privep);

/* OUT request and RxFIFO handling */

static void        gd32_rxfifo_read(struct gd32_ep_s *privep,
                     uint8_t *dest, uint16_t len);
static void        gd32_rxfifo_discard(struct gd32_ep_s *privep,
                     int len);
static void        gd32_epout_complete(struct gd32_usbdev_s *priv,
                     struct gd32_ep_s *privep);
static inline void gd32_ep0out_receive(struct gd32_ep_s *privep,
                     int bcnt);
static inline void gd32_epout_receive(struct gd32_ep_s *privep,
                     int bcnt);
static void        gd32_epout_request(struct gd32_usbdev_s *priv,
                     struct gd32_ep_s *privep);

/* General request handling */

static void        gd32_ep_flush(struct gd32_ep_s *privep);
static void        gd32_req_complete(struct gd32_ep_s *privep,
                     int16_t result);
static void        gd32_req_cancel(struct gd32_ep_s *privep,
                     int16_t status);

/* Interrupt handling *******************************************************/

static
struct gd32_ep_s *gd32_ep_findbyaddr(struct gd32_usbdev_s *priv,
                                           uint16_t eplog);
static int         gd32_req_dispatch(struct gd32_usbdev_s *priv,
                     const struct usb_ctrlreq_s *ctrl);
static void        gd32_usbreset(struct gd32_usbdev_s *priv);

/* Second level OUT endpoint interrupt processing */

static inline void gd32_ep0out_testmode(struct gd32_usbdev_s *priv,
                     uint16_t index);
static inline void gd32_ep0out_stdrequest(struct gd32_usbdev_s *priv,
                     struct gd32_ctrlreq_s *ctrlreq);
static inline void gd32_ep0out_setup(struct gd32_usbdev_s *priv);
static inline void gd32_epout(struct gd32_usbdev_s *priv,
                     uint8_t epno);
static inline
void gd32_epout_interrupt(struct gd32_usbdev_s *priv);

/* Second level IN endpoint interrupt processing */

static inline
void gd32_epin_runtestmode(struct gd32_usbdev_s *priv);
static inline
void gd32_epin(struct gd32_usbdev_s *priv, uint8_t epno);
static inline
void gd32_epin_txfifoempty(struct gd32_usbdev_s *priv,
                              int epno);
static inline void gd32_epin_interrupt(struct gd32_usbdev_s *priv);

/* Other second level interrupt processing */

static inline
void gd32_resumeinterrupt(struct gd32_usbdev_s *priv);
static inline
void gd32_suspendinterrupt(struct gd32_usbdev_s *priv);
static inline void gd32_rxinterrupt(struct gd32_usbdev_s *priv);
static inline void gd32_enuminterrupt(struct gd32_usbdev_s *priv);
#ifdef CONFIG_USBDEV_ISOCHRONOUS
static inline
void gd32_isocininterrupt(struct gd32_usbdev_s *priv);
static inline
void gd32_isocoutinterrupt(struct gd32_usbdev_s *priv);
#endif
#ifdef CONFIG_USBDEV_VBUSSENSING
static inline
void gd32_sessioninterrupt(struct gd32_usbdev_s *priv);
static inline void gd32_otginterrupt(struct gd32_usbdev_s *priv);
#endif

/* First level interrupt processing */

static int         gd32_usbinterrupt(int irq, void *context,
                     void *arg);

/* Endpoint operations ******************************************************/

/* Global OUT NAK controls */

static void        gd32_enablegonak(struct gd32_ep_s *privep);
static void        gd32_disablegonak(struct gd32_ep_s *privep);

/* Endpoint configuration */

static int         gd32_epout_configure(struct gd32_ep_s *privep,
                     uint8_t eptype, uint16_t maxpacket);
static int         gd32_epin_configure(struct gd32_ep_s *privep,
                     uint8_t eptype, uint16_t maxpacket);
static int         gd32_ep_configure(struct usbdev_ep_s *ep,
                     const struct usb_epdesc_s *desc, bool last);
static void        gd32_ep0_configure(struct gd32_usbdev_s *priv);

/* Endpoint disable */

static void        gd32_epout_disable(struct gd32_ep_s *privep);
static void        gd32_epin_disable(struct gd32_ep_s *privep);
static int         gd32_ep_disable(struct usbdev_ep_s *ep);

/* Endpoint request management */

static struct usbdev_req_s *gd32_ep_allocreq(struct usbdev_ep_s *ep);
static void        gd32_ep_freereq(struct usbdev_ep_s *ep,
                     struct usbdev_req_s *);

/* Endpoint buffer management */

#ifdef CONFIG_USBDEV_DMA
static void       *gd32_ep_allocbuffer(struct usbdev_ep_s *ep,
                     uint16_t bytes);
static void        gd32_ep_freebuffer(struct usbdev_ep_s *ep,
                     void *buf);
#endif

/* Endpoint request submission */

static int         gd32_ep_submit(struct usbdev_ep_s *ep,
                     struct usbdev_req_s *req);

/* Endpoint request cancellation */

static int         gd32_ep_cancel(struct usbdev_ep_s *ep,
                     struct usbdev_req_s *req);

/* Stall handling */

static int         gd32_epout_setstall(struct gd32_ep_s *privep);
static int         gd32_epin_setstall(struct gd32_ep_s *privep);
static int         gd32_ep_setstall(struct gd32_ep_s *privep);
static int         gd32_ep_clrstall(struct gd32_ep_s *privep);
static int         gd32_ep_stall(struct usbdev_ep_s *ep, bool resume);
static void        gd32_ep0_stall(struct gd32_usbdev_s *priv);

