GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfsdev.c
      if (count > 3)
        {
          /* Yes.. then show how many times the value repeated */

          uinfo("[repeats %d more times]\n", count - 3);
        }

      /* Save the new address, value, and count */

      prevaddr = addr;
      preval   = val;
      count    = 1;
    }

  /* Show the register value read */

  uinfo("%08x->%08x\n", addr, val);
  return val;
}
#endif

/****************************************************************************
 * Name: gd32_putreg
 *
 * Description:
 *   Set the contents of a GD32E11x register to a value
 *
 ****************************************************************************/

#if defined(CONFIG_GD32E11X_USBDEV_REGDEBUG) && defined(CONFIG_DEBUG_FEATURES)
static void gd32_putreg(uint32_t val, uint32_t addr)
{
  /* Show the register value being written */

  uinfo("%08x<-%08x\n", addr, val);

  /* Write the value */

  putreg32(val, addr);
}
#endif

/****************************************************************************
 * Name: gd32_req_remfirst
 *
 * Description:
 *   Remove a request from the head of an endpoint request queue
 *
 ****************************************************************************/

static struct gd32_req_s *
gd32_req_remfirst(struct gd32_ep_s *privep)
{
  struct gd32_req_s *ret = privep->head;

  if (ret)
    {
      privep->head = ret->flink;
      if (!privep->head)
        {
          privep->tail = NULL;
        }

      ret->flink = NULL;
    }

  return ret;
}

/****************************************************************************
 * Name: gd32_req_addlast
 *
 * Description:
 *   Add a request to the end of an endpoint request queue
 *
 ****************************************************************************/

static bool gd32_req_addlast(struct gd32_ep_s *privep,
                                struct gd32_req_s *req)
{
  bool is_empty = !privep->head;

  req->flink = NULL;
  if (is_empty)
    {
      privep->head = req;
      privep->tail = req;
    }
  else
    {
      privep->tail->flink = req;
      privep->tail        = req;
    }

  return is_empty;
}

/****************************************************************************
 * Name: gd32_ep0in_setupresponse
 *
 * Description:
 *   Schedule a short transfer on Endpoint 0 (IN or OUT)
 *
 ****************************************************************************/

static void gd32_ep0in_setupresponse(struct gd32_usbdev_s *priv,
                                        uint8_t *buf, uint32_t nbytes)
{
  gd32_epin_transfer(&priv->epin[EP0], buf, nbytes);
  priv->ep0state = EP0STATE_SETUPRESPONSE;
  gd32_ep0out_ctrlsetup(priv);
}

/****************************************************************************
 * Name: gd32_ep0in_transmitzlp
 *
 * Description:
 *   Send a zero length packet (ZLP) on endpoint 0 IN
 *
 ****************************************************************************/

static inline void
gd32_ep0in_transmitzlp(struct gd32_usbdev_s *priv)
{
  gd32_ep0in_setupresponse(priv, NULL, 0);
}

/****************************************************************************
 * Name: gd32_ep0in_activate
 *
 * Description:
 *   Activate the endpoint 0 IN endpoint.
 *
 ****************************************************************************/

static void gd32_ep0in_activate(void)
{
  uint32_t regval;

  /* Set the max packet size  of the IN EP. */

  regval  = gd32_getreg(GD32_USBFS_DIEPCTL(0));
  regval &= ~USBFS_DIEP0CTL_MPL_MASK;

#if CONFIG_USBDEV_EP0_MAXSIZE == 8
  regval |= USBFS_DIEP0CTL_MPL_8;
#elif CONFIG_USBDEV_EP0_MAXSIZE == 16
  regval |= USBFS_DIEP0CTL_MPL_16;
#elif CONFIG_USBDEV_EP0_MAXSIZE == 32
  regval |= USBFS_DIEP0CTL_MPL_32;
#elif CONFIG_USBDEV_EP0_MAXSIZE == 64
  regval |= USBFS_DIEP0CTL_MPL_64;
#else
#  error "Unsupported value of CONFIG_USBDEV_EP0_MAXSIZE"
#endif

  gd32_putreg(regval, GD32_USBFS_DIEPCTL(0));

  /* Clear global IN NAK */

  regval  = gd32_getreg(GD32_USBFS_DCTL);
  regval |= USBFS_DCTL_CGINAK;
  gd32_putreg(regval, GD32_USBFS_DCTL);
}

/****************************************************************************
 * Name: gd32_ep0out_ctrlsetup
 *
 * Description:
 *   Setup to receive a SETUP packet.
 *
 ****************************************************************************/

static void gd32_ep0out_ctrlsetup(struct gd32_usbdev_s *priv)
{
  uint32_t regval;

  /* Setup the hardware to perform the SETUP transfer */

  regval = ((USB_SIZEOF_CTRLREQ * 3) & USBFS_DOEP0LEN_TLEN_MASK) |
           (1 << USBFS_DOEP0LEN_PCNT_SHIFT) |
           (3 << USBFS_DOEP0LEN_STPCNT_SHIFT);
  gd32_putreg(regval, GD32_USBFS_DOEPLEN(0));

  /* Then clear NAKing and enable the transfer */

  regval  = gd32_getreg(GD32_USBFS_DOEPCTL(0));
  regval |= (USBFS_DOEP0CTL_CNAK | USBFS_DOEP0CTL_EPEN);
  gd32_putreg(regval, GD32_USBFS_DOEPCTL(0));
}

/****************************************************************************
 * Name: gd32_txfifo_write
 *
 * Description:
 *   Send data to the endpoint's TxFIFO.
 *
 ****************************************************************************/

static void gd32_txfifo_write(struct gd32_ep_s *privep,
                                 uint8_t *buf, int nbytes)
{
  uint32_t regaddr;
  uint32_t regval;
  int nwords;
  int i;

  /* Convert the number of bytes to words */

  nwords = (nbytes + 3) >> 2;

  /* Get the TxFIFO for this endpoint (same as the endpoint number) */

  regaddr = GD32_USBFS_DFIFO_DEP(privep->epphy);

  /* Then transfer each word to the TxFIFO */

  for (i = 0; i < nwords; i++)
    {
      /* Read four bytes from the source buffer (to avoid unaligned accesses)
       * and pack these into one 32-bit word (little endian).
       */

      regval  = (uint32_t)*buf++;
      regval |= ((uint32_t)*buf++) << 8;
      regval |= ((uint32_t)*buf++) << 16;
      regval |= ((uint32_t)*buf++) << 24;

      /* Then write the packet data to the TxFIFO */

      gd32_putreg(regval, regaddr);
    }
}

/****************************************************************************
 * Name: gd32_epin_transfer
 *
 * Description:
 *   Start the Tx data transfer
 *
 ****************************************************************************/

static void gd32_epin_transfer(struct gd32_ep_s *privep,
                                  uint8_t *buf, int nbytes)
{
  uint32_t pktcnt;
  uint32_t regval;

  /* Read the DIEPSIZx register */

  regval = gd32_getreg(GD32_USBFS_DIEPLEN(privep->epphy));

