GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfsdev.c
              privep->active = false;
              return;
            }

          uinfo("EP%d: len=%d\n", privep->epphy, privreq->req.len);

          /* Ignore any attempt to receive a zero length packet (this really
           * should not happen.
           */

          if (privreq->req.len <= 0)
            {
              usbtrace(TRACE_DEVERROR(GD32_TRACEERR_EPOUTNULLPACKET), 0);
              gd32_req_complete(privep, OK);
            }

          /* Otherwise, we have a usable read request...
           * break out of the loop
           */

          else
            {
              break;
            }
        }

      /* Setup the pending read into the request buffer.  First calculate:
       *
       * pktcnt  = the number of packets (of maxpacket bytes) required to
       *   perform the transfer.
       * xfrsize = The total number of bytes required (in units of
       *   maxpacket bytes).
       */

      pktcnt  = (privreq->req.len + (privep->ep.maxpacket - 1)) /
                 privep->ep.maxpacket;
      xfrsize = pktcnt * privep->ep.maxpacket;

      /* Then setup the hardware to perform this transfer */

      regaddr = GD32_USBFS_DOEPLEN(privep->epphy);
      regval  = gd32_getreg(regaddr);
      regval &= ~(USBFS_DOEPLEN_TLEN_MASK | USBFS_DOEPLEN_PCNT_MASK);
      regval |= (xfrsize << USBFS_DOEPLEN_TLEN_SHIFT);
      regval |= (pktcnt  << USBFS_DOEPLEN_PCNT_SHIFT);
      gd32_putreg(regval, regaddr);

      /* Then enable the transfer */

      regaddr = GD32_USBFS_DOEPCTL(privep->epphy);
      regval  = gd32_getreg(regaddr);

      /* When an isochronous transfer is enabled the Even/Odd frame bit must
       * also be set appropriately.
       */

#ifdef CONFIG_USBDEV_ISOCHRONOUS
      if (privep->eptype == USB_EP_ATTR_XFER_ISOC)
        {
          /* Check bit 0 of the frame number of the received SOF and set the
           * even/odd frame to match.
           */

          uint32_t status = gd32_getreg(GD32_USBFS_DSTAT);
          if ((status & USBFS_DSTAT_FNRSOF0) == USBFS_DSTAT_FNRSOF_EVEN)
            {
              regval |= USBFS_DOEPCTL_SEVFRM;
            }
          else
            {
              regval |= USBFS_DOEPCTL_SODDFRM;
            }
        }
#endif

      /* Clearing NAKing and enable the transfer. */

      regval |= (USBFS_DOEPCTL_CNAK | USBFS_DOEPCTL_EPEN);
      gd32_putreg(regval, regaddr);

      /* A transfer is now active on this endpoint */

      privep->active = true;

      /* EP0 is a special case.  We need to know when to switch back to
       * normal SETUP processing.
       */

      if (privep->epphy == EP0)
        {
          priv->ep0state = EP0STATE_DATA_OUT;
        }
    }
}

/****************************************************************************
 * Name: gd32_ep_flush
 *
 * Description:
 *   Flush any primed descriptors from this ep
 *
 ****************************************************************************/

static void gd32_ep_flush(struct gd32_ep_s *privep)
{
  if (privep->isin)
    {
      gd32_txfifo_flush(USBFS_GRSTCTL_TXFNUM_D(privep->epphy));
    }
  else
    {
      gd32_rxfifo_flush();
    }
}

/****************************************************************************
 * Name: gd32_req_complete
 *
 * Description:
 *   Handle termination of the request at the head of the endpoint request
 *   queue.
 *
 ****************************************************************************/

static void gd32_req_complete(struct gd32_ep_s *privep,
                                 int16_t result)
{
  struct gd32_req_s *privreq;

  /* Remove the request at the head of the request list */

  privreq = gd32_req_remfirst(privep);
  DEBUGASSERT(privreq != NULL);

  /* If endpoint 0, temporarily reflect the state of protocol stalled
   * in the callback.
   */

  bool stalled = privep->stalled;
  if (privep->epphy == EP0)
    {
      privep->stalled = privep->dev->stalled;
    }

  /* Save the result in the request structure */

  privreq->req.result = result;

  /* Callback to the request completion handler */

  privreq->req.callback(&privep->ep, &privreq->req);

  /* Restore the stalled indication */

  privep->stalled = stalled;
}

/****************************************************************************
 * Name: gd32_req_cancel
 *
 * Description:
 *   Cancel all pending requests for an endpoint
 *
 ****************************************************************************/

static void gd32_req_cancel(struct gd32_ep_s *privep, int16_t status)
{
  if (!gd32_rqempty(privep))
    {
      gd32_ep_flush(privep);
    }

  while (!gd32_rqempty(privep))
    {
      usbtrace(TRACE_COMPLETE(privep->epphy),
               (gd32_rqpeek(privep))->req.xfrd);
      gd32_req_complete(privep, status);
    }
}

/****************************************************************************
 * Name: gd32_ep_findbyaddr
 *
 * Description:
 *   Find the physical endpoint structure corresponding to a logic endpoint
 *   address
 *
 ****************************************************************************/

static
struct gd32_ep_s *gd32_ep_findbyaddr(struct gd32_usbdev_s *priv,
                                           uint16_t eplog)
{
  struct gd32_ep_s *privep;
  uint8_t epphy = USB_EPNO(eplog);

  if (epphy >= GD32_NENDPOINTS)
    {
      return NULL;
    }

  /* Is this an IN or an OUT endpoint? */

  if (USB_ISEPIN(eplog))
    {
      privep = &priv->epin[epphy];
    }
  else
    {
      privep = &priv->epout[epphy];
    }

  /* Return endpoint reference */

  DEBUGASSERT(privep->epphy == epphy);
  return privep;
}

/****************************************************************************
 * Name: gd32_req_dispatch
 *
 * Description:
 *   Provide unhandled setup actions to the class driver. This is logically
 *   part of the USB interrupt handler.
 *
 ****************************************************************************/

static int gd32_req_dispatch(struct gd32_usbdev_s *priv,
                                const struct usb_ctrlreq_s *ctrl)
{
  int ret = -EIO;

  usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_DISPATCH), 0);
  if (priv->driver)
    {
      /* Forward to the control request to the class driver implementation */

      ret = CLASS_SETUP(priv->driver, &priv->usbdev, ctrl,
                        priv->ep0data, priv->ep0datlen);
    }

