GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfsdev.c
  if (ret < 0)
    {
      /* Stall on failure */

      usbtrace(TRACE_DEVERROR(GD32_TRACEERR_DISPATCHSTALL), 0);
      priv->stalled = true;
    }

  return ret;
}

/****************************************************************************
 * Name: gd32_usbreset
 *
 * Description:
 *   Reset Usb engine
 *
 ****************************************************************************/

static void gd32_usbreset(struct gd32_usbdev_s *priv)
{
  struct gd32_ep_s *privep;
  uint32_t regval;
  int i;

  /* Clear the Remote Wake-up Signaling */

  regval = gd32_getreg(GD32_USBFS_DCTL);
  regval &= ~USBFS_DCTL_RWKUP;
  gd32_putreg(regval, GD32_USBFS_DCTL);

  /* Flush the EP0 Tx FIFO */

  gd32_txfifo_flush(USBFS_GRSTCTL_TXFNUM_D(EP0));

  /* Tell the class driver that we are disconnected. The class
   * driver should then accept any new configurations.
   */

  if (priv->driver)
    {
      CLASS_DISCONNECT(priv->driver, &priv->usbdev);
    }

  /* Mark all endpoints as available */

  priv->epavail[0] = GD32_EP_AVAILABLE;
  priv->epavail[1] = GD32_EP_AVAILABLE;

  /* Disable all end point interrupts */

  for (i = 0; i < GD32_NENDPOINTS ; i++)
    {
      /* Disable endpoint interrupts */

      gd32_putreg(0xff, GD32_USBFS_DIEPINTF(i));
      gd32_putreg(0xff, GD32_USBFS_DOEPINTF(i));

      /* Return write requests to the class implementation */

      privep = &priv->epin[i];
      gd32_req_cancel(privep, -ESHUTDOWN);

      /* Reset IN endpoint status */

      privep->stalled = false;

      /* Return read requests to the class implementation */

      privep = &priv->epout[i];
      gd32_req_cancel(privep, -ESHUTDOWN);

      /* Reset endpoint status */

      privep->stalled = false;
    }

  gd32_putreg(0xffffffff, GD32_USBFS_DAEPINT);

  /* Mask all device endpoint interrupts except EP0 */

  regval = (USBFS_DAEPINT_IEP(EP0) | USBFS_DAEPINT_OEP(EP0));
  gd32_putreg(regval, GD32_USBFS_DAEPINTEN);

  /* Unmask OUT interrupts */

  regval = (USBFS_DOEPINTEN_TFEN | USBFS_DOEPINTEN_STPFEN |
            USBFS_DOEPINTEN_EPDISEN);
  gd32_putreg(regval, GD32_USBFS_DOEPINTEN);

  /* Unmask IN interrupts */

  regval = (USBFS_DIEPINTEN_TFEN | USBFS_DIEPINTEN_EPDISEN |
            USBFS_DIEPINTEN_CITOEN);
  gd32_putreg(regval, GD32_USBFS_DIEPINTEN);

  /* Reset device address to 0 */

  gd32_setaddress(priv, 0);
  priv->devstate = DEVSTATE_DEFAULT;
  priv->usbdev.speed = USB_SPEED_FULL;

  /* Re-configure EP0 */

  gd32_ep0_configure(priv);

  /* Setup EP0 to receive SETUP packets */

  gd32_ep0out_ctrlsetup(priv);
}

/****************************************************************************
 * Name: gd32_ep0out_testmode
 *
 * Description:
 *   Select test mode
 *
 ****************************************************************************/

static inline void gd32_ep0out_testmode(struct gd32_usbdev_s *priv,
                                           uint16_t index)
{
  uint8_t testmode;

  testmode = index >> 8;
  switch (testmode)
    {
    case 1:
      priv->testmode = 1;
      break;

    case 2:
      priv->testmode = 2;
      break;

    case 3:
      priv->testmode = 3;
      break;

    case 4:
      priv->testmode = 4;
      break;

    case 5:
      priv->testmode = 5;
      break;

    default:
      usbtrace(TRACE_DEVERROR(GD32_TRACEERR_BADTESTMODE), testmode);
      priv->dotest   = false;
      priv->testmode = 0;
      priv->stalled  = true;
    }

  priv->dotest = true;
  gd32_ep0in_transmitzlp(priv);
}

/****************************************************************************
 * Name: gd32_ep0out_stdrequest
 *
 * Description:
 *   Handle a standard request on EP0.  Pick off the things of interest to
 *   the USB device controller driver; pass what is left to the class driver.
 *
 ****************************************************************************/

static inline
void gd32_ep0out_stdrequest(struct gd32_usbdev_s *priv,
                               struct gd32_ctrlreq_s *ctrlreq)
{
  struct gd32_ep_s *privep;

  /* Handle standard request */

  switch (ctrlreq->req)
    {
    case USB_REQ_GETSTATUS:
      {
        /* type:  device-to-host; recipient = device, interface, endpoint
         * value: 0
         * index: zero interface endpoint
         * len:   2; data = status
         */

        usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_GETSTATUS), 0);
        if (!priv->addressed ||
             ctrlreq->len != 2 ||
            USB_REQ_ISOUT(ctrlreq->type) ||
            ctrlreq->value != 0)
          {
            priv->stalled = true;
          }
        else
          {
            switch (ctrlreq->type & USB_REQ_RECIPIENT_MASK)
              {
              case USB_REQ_RECIPIENT_ENDPOINT:
                {
                  usbtrace(TRACE_INTDECODE(
                           GD32_TRACEINTID_EPGETSTATUS), 0);
                  privep = gd32_ep_findbyaddr(priv, ctrlreq->index);
                  if (!privep)
                    {
                      usbtrace(TRACE_DEVERROR(
                               GD32_TRACEERR_BADEPGETSTATUS), 0);
                      priv->stalled = true;
                    }
                  else
                    {
                      if (privep->stalled)
                        {
                          priv->ep0data[0] = (1 << USB_FEATURE_ENDPOINTHALT);
                        }
                      else
                        {
                          priv->ep0data[0] = 0; /* Not stalled */
                        }

                      priv->ep0data[1] = 0;
                      gd32_ep0in_setupresponse(priv, priv->ep0data, 2);
                    }
                }
                break;

              case USB_REQ_RECIPIENT_DEVICE:
                {
                  if (ctrlreq->index == 0)
                    {
                      usbtrace(TRACE_INTDECODE(
                               GD32_TRACEINTID_DEVGETSTATUS), 0);

                      /* Features:  Remote Wakeup and self-powered */

                      priv->ep0data[0]  = (priv->selfpowered <<
                                           USB_FEATURE_SELFPOWERED);
                      priv->ep0data[0] |= (priv->wakeup      <<
                                           USB_FEATURE_REMOTEWAKEUP);
                      priv->ep0data[1]  = 0;

                      gd32_ep0in_setupresponse(priv, priv->ep0data, 2);
                    }
                  else
                    {
                      usbtrace(TRACE_DEVERROR(
                               GD32_TRACEERR_BADDEVGETSTATUS), 0);
                      priv->stalled = true;
                    }
                }
                break;

              case USB_REQ_RECIPIENT_INTERFACE:
                {
                  usbtrace(TRACE_INTDECODE(
                           GD32_TRACEINTID_IFGETSTATUS), 0);
                  priv->ep0data[0] = 0;
                  priv->ep0data[1] = 0;

                  gd32_ep0in_setupresponse(priv, priv->ep0data, 2);
                }
                break;

              default:
                {
                  usbtrace(TRACE_DEVERROR(
                           GD32_TRACEERR_BADGETSTATUS), 0);
                  priv->stalled = true;
                }
                break;
              }
          }
      }
      break;

    case USB_REQ_CLEARFEATURE:
      {
        /* type:  host-to-device; recipient = device, interface or endpoint
         * value: feature selector
         * index: zero interface endpoint;
         * len:   zero, data = none
         */

        usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_CLEARFEATURE), 0);
        if (priv->addressed != 0 && ctrlreq->len == 0)
          {
            uint8_t recipient = ctrlreq->type & USB_REQ_RECIPIENT_MASK;
            if (recipient == USB_REQ_RECIPIENT_ENDPOINT &&
                ctrlreq->value == USB_FEATURE_ENDPOINTHALT &&
                (privep = gd32_ep_findbyaddr(priv, ctrlreq->index)) !=
                 NULL)
              {
                gd32_ep_clrstall(privep);
                gd32_ep0in_transmitzlp(priv);
              }
            else if (recipient == USB_REQ_RECIPIENT_DEVICE &&
                     ctrlreq->value == USB_FEATURE_REMOTEWAKEUP)
              {
                priv->wakeup = 0;
                gd32_ep0in_transmitzlp(priv);
              }
            else
              {
                /* Actually, I think we could just stall here. */

                gd32_req_dispatch(priv, &priv->ctrlreq);
              }
          }
        else
          {
            usbtrace(TRACE_DEVERROR(GD32_TRACEERR_BADCLEARFEATURE), 0);
            priv->stalled = true;
          }
      }
      break;

    case USB_REQ_SETFEATURE:
      {
        /* type:  host-to-device; recipient = device, interface, endpoint
         * value: feature selector
         * index: zero interface endpoint;
         * len:   0; data = none
         */

