GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfsdev.c
  gd32_req_cancel(&priv->epout[EP0], -EPROTO);
  gd32_req_cancel(&priv->epin[EP0],  -EPROTO);

  /* Assume NOT stalled */

  priv->epout[EP0].stalled = false;
  priv->epin[EP0].stalled = false;
  priv->stalled = false;

  /* Starting to process a control request - update state */

  priv->ep0state = EP0STATE_SETUP_PROCESS;

  /* And extract the little-endian 16-bit values to host order */

  ctrlreq.type  = priv->ctrlreq.type;
  ctrlreq.req   = priv->ctrlreq.req;
  ctrlreq.value = GETUINT16(priv->ctrlreq.value);
  ctrlreq.index = GETUINT16(priv->ctrlreq.index);
  ctrlreq.len   = GETUINT16(priv->ctrlreq.len);

  uinfo("type=%02x req=%02x value=%04x index=%04x len=%04x\n",
          ctrlreq.type, ctrlreq.req, ctrlreq.value,
          ctrlreq.index, ctrlreq.len);

  /* Check for a standard request */

  if ((ctrlreq.type & USB_REQ_TYPE_MASK) != USB_REQ_TYPE_STANDARD)
    {
      /* Dispatch any non-standard requests */

      gd32_req_dispatch(priv, &priv->ctrlreq);
    }
  else
    {
      /* Handle standard requests. */

      gd32_ep0out_stdrequest(priv, &ctrlreq);
    }

  /* Check if the setup processing resulted in a STALL */

  if (priv->stalled)
    {
      usbtrace(TRACE_DEVERROR(GD32_TRACEERR_EP0SETUPSTALLED),
               priv->ep0state);
      gd32_ep0_stall(priv);
    }

  /* Reset state/data associated with the SETUP request */

  priv->ep0datlen = 0;
}

/****************************************************************************
 * Name: gd32_epout
 *
 * Description:
 *   This is part of the OUT endpoint interrupt processing.  This function
 *   handles the OUT event for a single endpoint.
 *
 ****************************************************************************/

static inline void gd32_epout(struct gd32_usbdev_s *priv,
                                 uint8_t epno)
{
  struct gd32_ep_s *privep;

  /* Endpoint 0 is a special case. */

  if (epno == 0)
    {
      privep = &priv->epout[EP0];

      /* In the EP0STATE_DATA_OUT state, we are receiving data into the
       * request buffer.  In that case, we must continue the request
       * processing.
       */

      if (priv->ep0state == EP0STATE_DATA_OUT)
        {
          /* Continue processing data from the EP0 OUT request queue */

          gd32_epout_complete(priv, privep);

          /* If we are not actively processing an OUT request, then we
           * need to setup to receive the next control request.
           */

          if (!privep->active)
            {
              gd32_ep0out_ctrlsetup(priv);
              priv->ep0state = EP0STATE_IDLE;
            }
        }
    }

  /* For other endpoints, the only possibility is that we are continuing
   * or finishing an OUT request.
   */

  else if (priv->devstate == DEVSTATE_CONFIGURED)
    {
      gd32_epout_complete(priv, &priv->epout[epno]);
    }
}

/****************************************************************************
 * Name: gd32_epout_interrupt
 *
 * Description:
 *   USB OUT endpoint interrupt handler.
 *   The core generates this interrupt when  there is an interrupt is pending
 *   on one of the OUT endpoints of the core.
 *   The driver must read the USBFS DAEPINT register to determine the exact
 *   number of the OUT endpoint on which the interrupt occurred, and then
 *   read the corresponding USBFS DOEPxINTF register to determine the exact
 *   cause of the interrupt.
 *
 ****************************************************************************/

static inline void gd32_epout_interrupt(struct gd32_usbdev_s *priv)
{
  uint32_t daint;
  uint32_t regval;
  uint32_t doepint;
  int epno;

  /* Get the pending, enabled interrupts for the OUT endpoint from the
   * endpoint interrupt status register.
   */

  regval  = gd32_getreg(GD32_USBFS_DAEPINT);
  regval &= gd32_getreg(GD32_USBFS_DAEPINTEN);
  daint   = (regval & USBFS_DAEPINT_OEP_MASK) >> USBFS_DAEPINT_OEP_SHIFT;

  if (daint == 0)
    {
      /* We got an interrupt, but there is no unmasked endpoint that caused
       * it ?!  When this happens, the interrupt flag never gets cleared and
       * we are stuck in infinite interrupt loop.
       *
       * This shouldn't happen if we are diligent about handling timing
       * issues when masking endpoint interrupts. However, this workaround
       * avoids infinite loop and allows operation to continue normally.
       * It works by clearing each endpoint flags, masked or not.
       */

      regval  = gd32_getreg(GD32_USBFS_DAEPINT);
      daint   = (regval & USBFS_DAEPINT_OEP_MASK) >> USBFS_DAEPINT_OEP_SHIFT;

      usbtrace(TRACE_DEVERROR(GD32_TRACEERR_EPOUTUNEXPECTED),
               (uint16_t)regval);

      epno = 0;
      while (daint)
        {
          if ((daint & 1) != 0)
            {
              regval = gd32_getreg(GD32_USBFS_DOEPINTF(epno));
              uinfo("DOEPINT(%d) = %08" PRIx32 "\n", epno, regval);
              gd32_putreg(0xff, GD32_USBFS_DOEPINTF(epno));
            }

          epno++;
          daint >>= 1;
        }

      return;
    }

  /* Process each pending IN endpoint interrupt */

  epno = 0;
  while (daint)
    {
      /* Is an OUT interrupt pending for this endpoint? */

      if ((daint & 1) != 0)
        {
          /* Yes.. get the OUT endpoint interrupt status */

          doepint  = gd32_getreg(GD32_USBFS_DOEPINTF(epno));
          doepint &= gd32_getreg(GD32_USBFS_DOEPINTEN);

          /* Transfer completed interrupt.
           * This interrupt is triggered when gd32_rxinterrupt() removes
           * the last packet data from the RxFIFO.
           * In this case, core internally sets the NAK bit for this endpoint
           * to prevent it from receiving any more packets.
           */

          if ((doepint & USBFS_DOEPINTF_TF) != 0)
            {
              usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_EPOUT_XFRC),
                       (uint16_t)doepint);

              /* Clear the bit in DOEPINTn for this interrupt */

              gd32_putreg(USBFS_DOEPINTF_TF,
                             GD32_USBFS_DOEPINTF(epno));

