GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfsdev.c
              /* Handle the RX transfer data ready event */

              gd32_epout(priv, epno);
            }

          /* Endpoint disabled interrupt (ignored because this interrupt is
           * used in polled mode by the endpoint disable logic).
           */

          if ((doepint & USBFS_DOEPINTF_EPDIS) != 0)
            {
              usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_EPOUT_EPDISD),
                       (uint16_t)doepint);

              /* Clear the bit in DOEPINTn for this interrupt */

              gd32_putreg(USBFS_DOEPINTF_EPDIS,
                             GD32_USBFS_DOEPINTF(epno));
            }

          /* Setup Phase Done (control EPs) */

          if ((doepint & USBFS_DOEPINTF_STPF) != 0)
            {
              usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_EPOUT_SETUP),
                       priv->ep0state);

              /* Handle the receipt of the IN SETUP packets now (OUT setup
               * packet processing may be delayed until the accompanying
               * OUT DATA is received)
               */

              if (priv->ep0state == EP0STATE_SETUP_READY)
                {
                  gd32_ep0out_setup(priv);
                }
              else if (priv->ep0state == EP0STATE_SETUP_OUT)
                {
                  gd32_ep0out_ctrlsetup(priv);
                }

              gd32_putreg(USBFS_DOEPINTF_STPF,
                             GD32_USBFS_DOEPINTF(epno));
            }
        }

      epno++;
      daint >>= 1;
    }
}

/****************************************************************************
 * Name: gd32_epin_runtestmode
 *
 * Description:
 *   Execute the test mode setup by the SET FEATURE request
 *
 ****************************************************************************/

static inline
void gd32_epin_runtestmode(struct gd32_usbdev_s *priv)
{
  /* GD32E11x DCTL register does not have TCTL field (bits 4-6).
   * Test mode is not supported on this hardware.
   */

  priv->dotest = 0;
  priv->testmode = 0;
}

/****************************************************************************
 * Name: gd32_epin
 *
 * Description:
 *   This is part of the IN endpoint interrupt processing.  This function
 *   handles the IN event for a single endpoint.
 *
 ****************************************************************************/

static inline void gd32_epin(struct gd32_usbdev_s *priv,
                                uint8_t epno)
{
  struct gd32_ep_s *privep = &priv->epin[epno];

  /* Endpoint 0 is a special case. */

  if (epno == 0)
    {
      /* In the EP0STATE_DATA_IN state, we are sending data from request
       * buffer.  In that case, we must continue the request processing.
       */

      if (priv->ep0state == EP0STATE_DATA_IN)
        {
          /* Continue processing data from the EP0 OUT request queue */

          gd32_epin_request(priv, privep);

          /* If we are not actively processing an OUT request, then we
           * need to setup to receive the next control request.
           */

          if (!privep->active)
            {
              gd32_ep0out_ctrlsetup(priv);
              priv->ep0state = EP0STATE_IDLE;
            }
        }

      /* Test mode is another special case */

      if (priv->dotest)
        {
          gd32_epin_runtestmode(priv);
        }
    }

  /* For other endpoints, the only possibility is that we are continuing
   * or finishing an IN request.
   */

  else if (priv->devstate == DEVSTATE_CONFIGURED)
    {
      /* Continue processing data from the endpoint write request queue */

      gd32_epin_request(priv, privep);
    }
}

/****************************************************************************
 * Name: gd32_epin_txfifoempty
 *
 * Description:
 *   TxFIFO empty interrupt handling
 *
 ****************************************************************************/

static inline
void gd32_epin_txfifoempty(struct gd32_usbdev_s *priv, int epno)
{
  struct gd32_ep_s *privep = &priv->epin[epno];

  /* Continue processing the write request queue.  This may mean sending
   * more data from the existing request or terminating the current requests
   * and (perhaps) starting the IN transfer from the next write request.
   */

  gd32_epin_request(priv, privep);
}

/****************************************************************************
 * Name: gd32_epin_interrupt
 *
 * Description:
 *   USB IN endpoint interrupt handler.  The core generates this interrupt
 *   when an interrupt is pending on one of the IN endpoints of the core.
 *   The driver must read the USBFS DAEPINT register to determine the exact
 *   number of the IN endpoint on which the interrupt occurred, and then
 *   read the corresponding USBFS DIEPxINTF register to determine the exact
 *   cause of the interrupt.
 *
 ****************************************************************************/

static inline void gd32_epin_interrupt(struct gd32_usbdev_s *priv)
{
  uint32_t diepint;
  uint32_t daint;
  uint32_t mask;
  uint32_t empty;
  int epno;

  /* Get the pending, enabled interrupts for the IN endpoint from the
   * endpoint interrupt status register.
   */

  daint  = gd32_getreg(GD32_USBFS_DAEPINT);
  daint &= gd32_getreg(GD32_USBFS_DAEPINTEN);
  daint &= USBFS_DAEPINT_IEP_MASK;

  if (daint == 0)
    {
      /* We got an interrupt, but there is no unmasked endpoint that caused
       * it ?!  When this happens, the interrupt flag never gets cleared and
       * we are stuck in infinite interrupt loop.
       *
       * This shouldn't happen if we are diligent about handling timing
       * issues when masking endpoint interrupts. However, this workaround
       * avoids infinite loop and allows operation to continue normally.
       * It works by clearing each endpoint flags, masked or not.
       */

      daint  = gd32_getreg(GD32_USBFS_DAEPINT);
      usbtrace(TRACE_DEVERROR(GD32_TRACEERR_EPINUNEXPECTED),
               (uint16_t)daint);

      daint &= USBFS_DAEPINT_IEP_MASK;
      epno = 0;

      while (daint)
        {
          if ((daint & 1) != 0)
            {
              uerr("DIEPINT(%d) = %08" PRIx32 "\n",
                     epno, gd32_getreg(GD32_USBFS_DIEPINTF(epno)));
              gd32_putreg(0xff, GD32_USBFS_DIEPINTF(epno));
            }

