GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfsdev.c
          epno++;
          daint >>= 1;
        }

      return;
    }

  /* Process each pending IN endpoint interrupt */

  epno = 0;
  while (daint)
    {
      /* Is an IN interrupt pending for this endpoint? */

      if ((daint & 1) != 0)
        {
          /* Get IN interrupt mask register.  Bits 0-6 correspond to enabled
           * interrupts as will be found in the DIEPINT interrupt status
           * register.
           */

          mask = gd32_getreg(GD32_USBFS_DIEPINTEN);

          /* Check if the TxFIFO not empty interrupt is enabled for this
           * endpoint in the DIEPMSK register.  Bits n corresponds to
           * endpoint n in the register. That condition corresponds to
           * bit 7 of the DIEPINT interrupt status register.  There is
           * no TXFE bit in the mask register, so we fake one here.
           */

          empty = gd32_getreg(GD32_USBFS_DIEPFEINTEN);
          if ((empty & USBFS_DIEPFEINTEN(epno)) != 0)
            {
              mask |= USBFS_DIEPINTF_TXFE;
            }

          /* Now, read the interrupt status and mask out all disabled
           * interrupts.
           */

          diepint = gd32_getreg(GD32_USBFS_DIEPINTF(epno)) & mask;

          /* Decode and process the enabled, pending interrupts */

          /* Transfer completed interrupt */

          if ((diepint & USBFS_DIEPINTF_TF) != 0)
            {
              usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_EPIN_XFRC),
                       (uint16_t)diepint);

              /* It is possible that logic may be waiting for a the
               * TxFIFO to become empty.  We disable the TxFIFO empty
               * interrupt here; it will be re-enabled if there is still
               * insufficient space in the TxFIFO.
               */

              empty &= ~USBFS_DIEPFEINTEN(epno);
              gd32_putreg(empty, GD32_USBFS_DIEPFEINTEN);
              gd32_putreg(USBFS_DIEPINTF_TF,
                             GD32_USBFS_DIEPINTF(epno));

              /* IN transfer complete */

              gd32_epin(priv, epno);
            }

          /* Timeout condition */

          if ((diepint & USBFS_DIEPINTF_CITO) != 0)
            {
              usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_EPIN_TOC),
                      (uint16_t)diepint);
              gd32_putreg(USBFS_DIEPINTF_CITO, GD32_USBFS_DIEPINTF(epno));
            }

          /* IN token received when TxFIFO is empty.  Applies to non-periodic
           * IN endpoints only.  This interrupt indicates that an IN token
           * was received when the associated TxFIFO (periodic/non-periodic)
           * was empty. This interrupt is asserted on the endpoint for which
           * the IN token was received.
           */

          if ((diepint & USBFS_DIEPINTF_EPTXFUD) != 0)
            {
              usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_EPIN_ITTXFE),
                      (uint16_t)diepint);
              gd32_epin_request(priv, &priv->epin[epno]);
              gd32_putreg(USBFS_DIEPINTF_EPTXFUD,
                             GD32_USBFS_DIEPINTF(epno));
            }

          /* Transmit FIFO empty */

          if ((diepint & USBFS_DIEPINTF_TXFE) != 0)
            {
              usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_EPIN_TXFE),
                      (uint16_t)diepint);

              /* If we were waiting for TxFIFO to become empty, the we might
               * have both XFRC and TXFE interrupts pending.  Since we do the
               * same thing for both cases, ignore the TXFE if we have
               * already processed the XFRC.
               */

              if ((diepint & USBFS_DIEPINTF_TF) == 0)
                {
                  /* Mask further FIFO empty interrupts.  This will be
                   * re-enabled whenever we need to wait for a FIFO event.
                   */

                  empty &= ~USBFS_DIEPFEINTEN(epno);
                  gd32_putreg(empty, GD32_USBFS_DIEPFEINTEN);

                  /* Handle TxFIFO empty */

                  gd32_epin_txfifoempty(priv, epno);
                }

              /* Clear the pending TxFIFO empty interrupt */

              gd32_putreg(USBFS_DIEPINTF_TXFE,
                             GD32_USBFS_DIEPINTF(epno));
            }
        }

      epno++;
      daint >>= 1;
    }
}

/****************************************************************************
 * Name: gd32_resumeinterrupt
 *
 * Description:
 *   Resume/remote wakeup detected interrupt
 *
 ****************************************************************************/

static inline void gd32_resumeinterrupt(struct gd32_usbdev_s *priv)
{
  uint32_t regval;

  /* Restart the PHY clock and un-gate USB core clock (HCLK) */

#ifdef CONFIG_USBDEV_LOWPOWER
  regval = gd32_getreg(GD32_USBFS_PWRCLKCTL);
  regval &= ~(USBFS_PWRCLKCTL_SUCLK | USBFS_PWRCLKCTL_SHCLK);
  gd32_putreg(regval, GD32_USBFS_PWRCLKCTL);
#endif

  /* Clear remote wake-up signaling */

  regval  = gd32_getreg(GD32_USBFS_DCTL);
  regval &= ~USBFS_DCTL_RWKUP;
  gd32_putreg(regval, GD32_USBFS_DCTL);

  /* Restore full power -- whatever that means for this particular board */

  gd32_usbsuspend((struct usbdev_s *)priv, true);

  /* Notify the class driver of the resume event */

  if (priv->driver)
    {
      CLASS_RESUME(priv->driver, &priv->usbdev);
    }
}

/****************************************************************************
 * Name: gd32_suspendinterrupt
 *
 * Description:
 *   USB suspend interrupt
 *
 ****************************************************************************/

static inline
void gd32_suspendinterrupt(struct gd32_usbdev_s *priv)
{
#ifdef CONFIG_USBDEV_LOWPOWER
  uint32_t regval;
#endif

  /* Notify the class driver of the suspend event */

  if (priv->driver)
    {
      CLASS_SUSPEND(priv->driver, &priv->usbdev);
    }

#ifdef CONFIG_USBDEV_LOWPOWER
  /* USBFS_DSTAT_SPST is set as long as the suspend condition is detected
   * on USB.  Check if we are still have the suspend condition, that we are
   * connected to the host, and that we have been configured.
   */

  regval = gd32_getreg(GD32_USBFS_DSTAT);

  if ((regval & USBFS_DSTAT_SPST) != 0 &&
      priv->devstate == DEVSTATE_CONFIGURED)
    {
      /* Switch off USBFS clocking.  Setting USBFS_PWRCLKCTL_SUCLK stops the
       * PHY clock.
       */

      regval = gd32_getreg(GD32_USBFS_PWRCLKCTL);
      regval |= USBFS_PWRCLKCTL_SUCLK;
      gd32_putreg(regval, GD32_USBFS_PWRCLKCTL);

