GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfsdev.c
      /* Setting USBFS_PWRCLKCTL_SHCLK gate HCLK to modules other than
       * the AHB Slave and Master and wakeup logic.
       */

      regval |= USBFS_PWRCLKCTL_SHCLK;
      gd32_putreg(regval, GD32_USBFS_PWRCLKCTL);
    }
#endif

  /* Let the board-specific logic know that we have entered the suspend
   * state
   */

  gd32_usbsuspend((struct usbdev_s *)priv, false);
}

/****************************************************************************
 * Name: gd32_rxinterrupt
 *
 * Description:
 *   RxFIFO non-empty interrupt.  This interrupt indicates that there is at
 *   least one packet pending to be read from the RxFIFO.
 *
 ****************************************************************************/

static inline void gd32_rxinterrupt(struct gd32_usbdev_s *priv)
{
  struct gd32_ep_s *privep;
  uint32_t regval;
  int bcnt;
  int epphy;

  while (0 != (gd32_getreg(GD32_USBFS_GINTF) & USBFS_GINTF_RXFNEIF))
    {
      /* Get the status from the top of the FIFO */

      regval = gd32_getreg(GD32_USBFS_GRSTATP);

      /* Decode status fields */

      epphy  = (regval & USBFS_GRXSTAD_EPNUM_MASK) >>
                USBFS_GRXSTAD_EPNUM_SHIFT;

      /* Workaround for bad values read from the GD32_USBFS_GRSTATP
       * register happens regval is 0xb4e48168 or 0xa80c9367 or 267E781c
       * All of which provide out of range indexes for  epout[epphy]
       */

      if (epphy < GD32_NENDPOINTS)
        {
          privep = &priv->epout[epphy];

          /* Handle the RX event according to the packet status field */

          switch (regval & USBFS_GRXSTAD_RPCKST_MASK)
            {
            /* Global OUT NAK.
             * This indicate that the global OUT NAK bit has taken effect.
             *
             * PKTSTS = Global OUT NAK, BCNT = 0, EPNUM = Don't Care,
             *          DPID = Don't Care.
             */

            case USBFS_GRXSTAD_RPCKST_OUTNAK:
              {
                usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_OUTNAK), 0);
              }
              break;

            /* OUT data packet received.
             *
             * PKTSTS = DataOUT, BCNT = size of the received data OUT packet,
             * EPNUM = EPNUM on which the packet was received,
             *         DPID = Actual Data PID.
             */

            case USBFS_GRXSTAD_RPCKST_OUTRECVD:
              {
                usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_OUTRECVD),
                         epphy);
                bcnt = (regval & USBFS_GRXSTAD_BCOUNT_MASK) >>
                        USBFS_GRXSTAD_BCOUNT_SHIFT;
                if (bcnt > 0)
                  {
                    gd32_epout_receive(privep, bcnt);
                  }
              }
              break;

            /* OUT transfer completed.
             * This indicates that an OUT data transfer for the specified
             * OUT endpoint has completed. After this entry is popped from
             * the receive FIFO, the core asserts a Transfer Completed
             * interrupt on the specified OUT endpoint.
             *
             * PKTSTS = Data OUT Transfer Done, BCNT = 0,
             * EPNUM = OUT EP Num on
             * which the data transfer is complete, DPID = Don't Care.
             */

            case USBFS_GRXSTAD_RPCKST_OUTDONE:
              {
                usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_OUTDONE), epphy);
              }
              break;

            /* SETUP transaction completed.
             * This indicates that the Setup stage for the specified endpoint
             * has completed and the Data stage has started.
             * After this entry is popped from the receive FIFO, the core
             * asserts a Setup interrupt on the specified control OUT
             * endpoint (triggers an interrupt).
             *
             * PKTSTS = Setup Stage Done, BCNT = 0, EPNUM = Control EP Num,
             * DPID = Don't Care.
             */

            case USBFS_GRXSTAD_RPCKST_SETUPDONE:
              {
                usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_SETUPDONE),
                         epphy);

                /* On the GD32E11x, this event does not occur on the next
                 * SETUP
                 * after a SETUP OUT.
                 */
              }
              break;

            /* SETUP data packet received.
             * This indicates that a SETUP packet for the specified endpoint
             * is now available for reading from the receive FIFO.
             *
             * PKTSTS = SETUP, BCNT = 8, EPNUM = Control EP Num, DPID = D0.
             */

            case USBFS_GRXSTAD_RPCKST_SETUPRECVD:
              {
                uint16_t datlen;

                usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_SETUPRECVD),
                         epphy);

                /* Read EP0 setup data.  NOTE:  If multiple SETUP packets are
                 * received, the last one overwrites the previous setup
                 * packets and only that last SETUP packet will be processed.
                 */

                gd32_rxfifo_read(&priv->epout[EP0],
                                    (uint8_t *)&priv->ctrlreq,
                                    USB_SIZEOF_CTRLREQ);

                /* Was this an IN or an OUT SETUP packet.  If it is an OUT
                 * SETUP, then we need to wait for the completion of the data
                 * phase to process the setup command.  If it is an IN SETUP
                 * packet, then we must processing the command BEFORE we
                 * enter the DATA phase.
                 *
                 * If the data associated with the OUT SETUP packet is zero
                 * length, then, of course, we don't need to wait.
                 */

                datlen = GETUINT16(priv->ctrlreq.len);
                if (USB_REQ_ISOUT(priv->ctrlreq.type) && datlen > 0)
                  {
                    /* Wait for the data phase.
                     * On GD32, defer gd32_ep0out_ctrlsetup() to STPF.
                     */

                    priv->ep0state = EP0STATE_SETUP_OUT;
                  }
                else
                  {
                    /* On GD32, we must wait for STPF interrupt
                     * before processing the SETUP data. Writing to
                     * TX FIFO before SETUP phase completes causes
                     * the hardware to NAK IN tokens indefinitely.
                     */

