GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfsdev.c
                    priv->ep0state = EP0STATE_SETUP_READY;
                  }
              }
              break;

            default:
              {
                usbtrace(TRACE_DEVERROR(GD32_TRACEERR_INVALIDPARMS),
                         (regval & USBFS_GRXSTAD_RPCKST_MASK) >>
                         USBFS_GRXSTAD_RPCKST_SHIFT);
              }
              break;
            }
        }
    }
}

/****************************************************************************
 * Name: gd32_enuminterrupt
 *
 * Description:
 *   Enumeration done interrupt
 *
 ****************************************************************************/

static inline void gd32_enuminterrupt(struct gd32_usbdev_s *priv)
{
  uint32_t regval;

  /* Activate EP0 */

  gd32_ep0in_activate();

  /* Set USB turn-around time for the full speed device with internal
   * PHY interface.
   */

  regval  = gd32_getreg(GD32_USBFS_GUSBCS);
  regval &= ~USBFS_GUSBCS_UTT_MASK;
  regval |=  USBFS_GUSBCS_UTT(6);
  gd32_putreg(regval, GD32_USBFS_GUSBCS);
}

/****************************************************************************
 * Name: gd32_isocininterrupt
 *
 * Description:
 *   Incomplete isochronous IN transfer interrupt.  Assertion of the
 *   incomplete isochronous IN transfer interrupt indicates an incomplete
 *   isochronous IN transfer on at least one of the isochronous IN endpoints.
 *
 ****************************************************************************/

#ifdef CONFIG_USBDEV_ISOCHRONOUS
static inline void gd32_isocininterrupt(struct gd32_usbdev_s *priv)
{
  struct gd32_ep_s *privep;
  uint32_t regaddr;
  uint32_t doepctl;
  uint32_t dsts;
  bool eonum;
  bool soffn;
  int i;

  /* The application must read the endpoint control register for all
   * isochronous IN endpoints to detect endpoints with incomplete IN data
   * transfers.
   */

  for (i = 0; i < GD32_NENDPOINTS; i++)
    {
      /* Is this an isochronous IN endpoint? */

      privep = &priv->epin[i];
      if (privep->eptype != USB_EP_ATTR_XFER_ISOC)
        {
          /* No... keep looking */

          continue;
        }

      /* Is there an active read request on the isochronous OUT endpoint? */

      if (!privep->active)
        {
          /* No.. the endpoint is not actively transmitting data */

          continue;
        }

      /* Check if this is the endpoint that had the incomplete transfer */

      regaddr = GD32_USBFS_DIEPCTL(privep->epphy);
      doepctl = gd32_getreg(regaddr);
      dsts    = gd32_getreg(GD32_USBFS_DSTAT);

      /* EONUM = 0:even frame, 1:odd frame
       * SOFFN = Frame number of the received SOF
       */

      eonum = ((doepctl & USBFS_DIEPCTL_EOFRM_DPID) != 0);
      soffn = ((dsts & USBFS_DSTAT_FNRSOF0) != 0);

      if (eonum != soffn)
        {
          /* Not this endpoint */

          continue;
        }

      /* For isochronous IN endpoints with incomplete transfers,
       * the application must discard the data in the memory and
       * disable the endpoint.
       */

      gd32_req_complete(privep, -EIO);
      gd32_epin_disable(privep);
      break;
    }
}
#endif

/****************************************************************************
 * Name: gd32_isocoutinterrupt
 *
 * Description:
 *   Incomplete periodic transfer interrupt
 *
 ****************************************************************************/

#ifdef CONFIG_USBDEV_ISOCHRONOUS
static inline
void gd32_isocoutinterrupt(struct gd32_usbdev_s *priv)
{
  struct gd32_ep_s *privep;
  struct gd32_req_s *privreq;
  uint32_t regaddr;
  uint32_t doepctl;
  uint32_t dsts;
  bool eonum;
  bool soffn;
  int i;

  /* When it receives an IISOOXFR interrupt, the application must read the
   * control registers of all isochronous OUT endpoints to determine which
   * endpoints had an incomplete transfer in the current microframe. An
   * endpoint transfer is incomplete if both the following conditions are
   * true:
   *
   *   DOEPCTLx:EONUM = DSTS:SOFFN[0], and
   *   DOEPCTLx:EPENA = 1
   */

  for (i = 0; i < GD32_NENDPOINTS; i++)
    {
      /* Is this an isochronous OUT endpoint? */

      privep = &priv->epout[i];
      if (privep->eptype != USB_EP_ATTR_XFER_ISOC)
        {
          /* No... keep looking */

          continue;
        }

      /* Is there an active read request on the isochronous OUT endpoint? */

      if (!privep->active)
        {
          /* No.. the endpoint is not actively transmitting data */

          continue;
        }

      /* Check if this is the endpoint that had the incomplete transfer */

      regaddr = GD32_USBFS_DOEPCTL(privep->epphy);
      doepctl = gd32_getreg(regaddr);
      dsts    = gd32_getreg(GD32_USBFS_DSTAT);

      /* EONUM = 0:even frame, 1:odd frame
       * SOFFN = Frame number of the received SOF
       */

      eonum = ((doepctl & USBFS_DOEPCTL_EOFRM_DPID) != 0);
      soffn = ((dsts & USBFS_DSTAT_FNRSOF0) != 0);

      if (eonum != soffn)
        {
          /* Not this endpoint */

          continue;
        }

      /* For isochronous OUT endpoints with incomplete transfers,
       * the application must discard the data in the memory and
       * disable the endpoint.
       */

      gd32_req_complete(privep, -EIO);
      gd32_epout_disable(privep);
      break;
    }
}
#endif

/****************************************************************************
 * Name: gd32_sessioninterrupt
 *
 * Description:
 *   Session request/new session detected interrupt
 *
 ****************************************************************************/

#ifdef CONFIG_USBDEV_VBUSSENSING
static inline
void gd32_sessioninterrupt(struct gd32_usbdev_s *priv)
{
}
#endif

/****************************************************************************
 * Name: gd32_otginterrupt
 *
 * Description:
 *   OTG interrupt
 *
 ****************************************************************************/

#ifdef CONFIG_USBDEV_VBUSSENSING
static inline void gd32_otginterrupt(struct gd32_usbdev_s *priv)
{
  uint32_t regval;

