GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfsdev.c
  /* Check for session end detected */

  regval = gd32_getreg(GD32_USBFS_GOTGINTF);
  if ((regval & USBFS_GOTGINTF_SESEND) != 0)
    {
    }

  /* Clear OTG interrupt */

  gd32_putreg(regval, GD32_USBFS_GOTGINTF);
}
#endif

/****************************************************************************
 * Name: gd32_usbinterrupt
 *
 * Description:
 *   USB interrupt handler
 *
 ****************************************************************************/

static int gd32_usbinterrupt(int irq, void *context, void *arg)
{
  /* At present, there is only a single USBFS device support. Hence it is
   * pre-allocated as g_usbfsdev.  However, in most code, the private data
   * structure will be referenced using the 'priv' pointer (rather than the
   * global data) in order to simplify any future support for multiple
   * devices.
   */

  struct gd32_usbdev_s *priv = &g_usbfsdev;
  uint32_t regval;
  uint32_t reserved;

  usbtrace(TRACE_INTENTRY(GD32_TRACEINTID_USB), priv->ep0state);

  /* Assure that we are in device mode */

  DEBUGASSERT((gd32_getreg(GD32_USBFS_GINTF) & USBFS_GINTF_COPM) ==
               USBFS_GINTF_DEVMODE);

  /* Get the state of all enabled interrupts.  We will do this repeatedly
   * some interrupts (like RXFLVL) will generate additional interrupting
   * events.
   */

  for (; ; )
    {
      /* Get the set of pending, un-masked interrupts */

      regval  = gd32_getreg(GD32_USBFS_GINTF);
      reserved = (regval & USBFS_GINTF_RESERVED);
      regval &= gd32_getreg(GD32_USBFS_GINTEN);

      /* With out modifying the reserved bits, acknowledge all
       * **Writable** pending irqs we will service below
       */

      gd32_putreg(((regval | reserved) & USBFS_GINTF_RC_W1),
                       GD32_USBFS_GINTF);

      /* Break out of the loop when there are no further pending (and
       * unmasked) interrupts to be processes.
       */

      if (regval == 0)
        {
          break;
        }

      usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_INTPENDING),
              (uint16_t)regval);

      /* OUT endpoint interrupt. The core sets this bit to indicate that an
       * interrupt is pending on one of the OUT endpoints of the core.
       */

      if ((regval & USBFS_GINTF_OEPIF) != 0)
        {
          usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_EPOUT),
                  (uint16_t)regval);
          gd32_epout_interrupt(priv);
        }

      /* IN endpoint interrupt.  The core sets this bit to indicate that
       * an interrupt is pending on one of the IN endpoints of the core.
       */

      if ((regval & USBFS_GINTF_IEPIF) != 0)
        {
          usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_EPIN),
                  (uint16_t)regval);
          gd32_epin_interrupt(priv);
        }

      /* Host/device mode mismatch error interrupt */

#ifdef CONFIG_DEBUG_FEATURES
      if ((regval & USBFS_GINTF_MFIF) != 0)
        {
          usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_MISMATCH),
                  (uint16_t)regval);
        }
#endif

      /* Resume/remote wakeup detected interrupt */

      if ((regval & USBFS_GINTF_WKUPIF) != 0)
        {
          usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_WAKEUP),
                  (uint16_t)regval);
          gd32_resumeinterrupt(priv);
        }

      /* USB suspend interrupt */

      if ((regval & USBFS_GINTF_SP) != 0)
        {
          usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_SUSPEND),
                  (uint16_t)regval);
          gd32_suspendinterrupt(priv);
        }

      /* Start of frame interrupt */

#ifdef CONFIG_USBDEV_SOFINTERRUPT
      if ((regval & USBFS_GINTF_SOF) != 0)
        {
          usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_SOF),
                  (uint16_t)regval);
          usbdev_sof_irq(&priv->usbdev, gd32_getframe(&priv->usbdev));
        }
#endif

      /* RxFIFO non-empty interrupt.  Indicates that there is at least one
       * packet pending to be read from the RxFIFO.
       */

      if ((regval & USBFS_GINTF_RXFNEIF) != 0)
        {
          usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_RXFIFO),
                  (uint16_t)regval);
          gd32_rxinterrupt(priv);
        }

      /* Enumeration done interrupt */

      if ((regval & USBFS_GINTF_ENUMF) != 0)
        {
          usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_ENUMDNE),
                  (uint16_t)regval);
          gd32_enuminterrupt(priv);
        }

      /* USB reset interrupt */

      if ((regval & USBFS_GINTF_RST) != 0)
        {
          usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_DEVRESET),
                  (uint16_t)regval);

          /* Perform the device reset */

          gd32_usbreset(priv);
          usbtrace(TRACE_INTEXIT(GD32_TRACEINTID_USB), priv->ep0state);
          return OK;
        }

      /* Incomplete isochronous IN transfer interrupt.  When the core finds
       * non-empty any of the isochronous IN endpoint FIFOs scheduled for
       * the current frame non-empty, the core generates an IISOIXFR
       * interrupt.
       */

#ifdef CONFIG_USBDEV_ISOCHRONOUS
      if ((regval & USBFS_GINTF_ISOINCIF) != 0)
        {
          usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_IISOIXFR),
                  (uint16_t)regval);
          gd32_isocininterrupt(priv);
        }

      /* Incomplete isochronous OUT transfer.  For isochronous OUT
       * endpoints, the XFRC interrupt may not always be asserted. If the
       * core drops isochronous OUT data packets, the application could fail
       * to detect the XFRC interrupt.  The incomplete Isochronous OUT data
       * interrupt indicates that an XFRC interrupt was not asserted on at
       * least one of the isochronous OUT endpoints. At this point, the
       * endpoint with the incomplete transfer remains enabled, but no active
       * transfers remain in progress on this endpoint on the USB.
       */

      if ((regval & USBFS_GINTF_PXNCIF_ISOONCIF) != 0)
        {
          usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_IISOOXFR),
                  (uint16_t)regval);
          gd32_isocoutinterrupt(priv);
        }
#endif

      /* Session request/new session detected interrupt */

#ifdef CONFIG_USBDEV_VBUSSENSING
      if ((regval & USBFS_GINTF_SESIF) != 0)
        {
          usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_SRQ),
                  (uint16_t)regval);
          gd32_sessioninterrupt(priv);
        }

      /* OTG interrupt */

      if ((regval & USBFS_GINTF_OTGIF) != 0)
        {
          usbtrace(TRACE_INTDECODE(GD32_TRACEINTID_OTG),
                  (uint16_t)regval);
          gd32_otginterrupt(priv);
        }
#endif
    }

