GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfsdev.c
  usbtrace(TRACE_INTEXIT(GD32_TRACEINTID_USB), priv->ep0state);
  return OK;
}

/****************************************************************************
 * Endpoint operations
 ****************************************************************************/

/****************************************************************************
 * Name: gd32_enablegonak
 *
 * Description:
 *   Enable global OUT NAK mode
 *
 ****************************************************************************/

static void gd32_enablegonak(struct gd32_ep_s *privep)
{
  uint32_t regval;

  /* First, make sure that there is no GNOAKEFF interrupt pending. */

  /* Enable Global OUT NAK mode in the core. */

  regval = gd32_getreg(GD32_USBFS_DCTL);
  regval |= USBFS_DCTL_SGONAK;
  gd32_putreg(regval, GD32_USBFS_DCTL);

  /* Since we are in the interrupt handler, we cannot wait inline for the
   * GONAKEFF because it cannot occur until service the RXFLVL global
   * interrupt and pop the OUTNAK word from the RxFIFO.
   *
   * Perhaps it is sufficient to wait for Global OUT NAK status to be
   * reported in USBFS DCTL register?
   */

  while ((gd32_getreg(GD32_USBFS_DCTL) & USBFS_DCTL_GONS) == 0);
}

/****************************************************************************
 * Name: gd32_disablegonak
 *
 * Description:
 *   Disable global OUT NAK mode
 *
 ****************************************************************************/

static void gd32_disablegonak(struct gd32_ep_s *privep)
{
  uint32_t regval;

  /* Set the "Clear the Global OUT NAK bit" to disable global OUT NAK mode */

  regval  = gd32_getreg(GD32_USBFS_DCTL);
  regval |= USBFS_DCTL_CGONAK;
  gd32_putreg(regval, GD32_USBFS_DCTL);
}

/****************************************************************************
 * Name: gd32_epout_configure
 *
 * Description:
 *   Configure an OUT endpoint, making it usable
 *
 * Input Parameters:
 *   privep    - a pointer to an internal endpoint structure
 *   eptype    - The type of the endpoint
 *   maxpacket - The max packet size of the endpoint
 *
 ****************************************************************************/

static int gd32_epout_configure(struct gd32_ep_s *privep,
                                   uint8_t eptype, uint16_t maxpacket)
{
  uint32_t mpsiz;
  uint32_t regaddr;
  uint32_t regval;

  usbtrace(TRACE_EPCONFIGURE, privep->epphy);

  /* For EP0, the packet size is encoded */

  if (privep->epphy == EP0)
    {
      DEBUGASSERT(eptype == USB_EP_ATTR_XFER_CONTROL);

      /* Map the size in bytes to the encoded value in the register */

      switch (maxpacket)
        {
          case 8:
            mpsiz = USBFS_DOEP0CTL_MPL_8;
            break;

          case 16:
            mpsiz = USBFS_DOEP0CTL_MPL_16;
            break;

          case 32:
            mpsiz = USBFS_DOEP0CTL_MPL_32;
            break;

          case 64:
            mpsiz = USBFS_DOEP0CTL_MPL_64;
            break;

          default:
            uerr("Unsupported maxpacket: %d\n", maxpacket);
            return -EINVAL;
        }
    }

  /* For other endpoints, the packet size is in bytes */

  else
    {
      mpsiz = (maxpacket << USBFS_DOEPCTL_MPL_SHIFT);
    }

  /* If the endpoint is already active don't change the endpoint control
   * register.
   */

  regaddr = GD32_USBFS_DOEPCTL(privep->epphy);
  regval  = gd32_getreg(regaddr);
  if ((regval & USBFS_DOEPCTL_EPACT) == 0)
    {
      if (regval & USBFS_DOEPCTL_NAKS)
        {
          regval |= USBFS_DOEPCTL_CNAK;
        }

      regval &= ~(USBFS_DOEPCTL_MPL_MASK | USBFS_DOEPCTL_EPTYPE_MASK);
      regval |= mpsiz;
      regval |= (eptype << USBFS_DOEPCTL_EPTYPE_SHIFT);
      regval |= (USBFS_DOEPCTL_SD0PID | USBFS_DOEPCTL_EPACT);
      gd32_putreg(regval, regaddr);

      /* Save the endpoint configuration */

      privep->ep.maxpacket = maxpacket;
      privep->eptype       = eptype;
      privep->stalled      = false;
    }

  /* Enable the interrupt for this endpoint */

  regval = gd32_getreg(GD32_USBFS_DAEPINTEN);
  regval |= USBFS_DAEPINT_OEP(privep->epphy);
  gd32_putreg(regval, GD32_USBFS_DAEPINTEN);
  return OK;
}

/****************************************************************************
 * Name: gd32_epin_configure
 *
 * Description:
 *   Configure an IN endpoint, making it usable
 *
 * Input Parameters:
 *   privep    - a pointer to an internal endpoint structure
 *   eptype    - The type of the endpoint
 *   maxpacket - The max packet size of the endpoint
 *
 ****************************************************************************/

static int gd32_epin_configure(struct gd32_ep_s *privep,
                                  uint8_t eptype,
                                  uint16_t maxpacket)
{
  uint32_t mpsiz;
  uint32_t regaddr;
  uint32_t regval;

  usbtrace(TRACE_EPCONFIGURE, privep->epphy);

  /* For EP0, the packet size is encoded */

  if (privep->epphy == EP0)
    {
      DEBUGASSERT(eptype == USB_EP_ATTR_XFER_CONTROL);

      /* Map the size in bytes to the encoded value in the register */

      switch (maxpacket)
        {
          case 8:
            mpsiz = USBFS_DIEP0CTL_MPL_8;
            break;

          case 16:
            mpsiz = USBFS_DIEP0CTL_MPL_16;
            break;

          case 32:
            mpsiz = USBFS_DIEP0CTL_MPL_32;
            break;

          case 64:
            mpsiz = USBFS_DIEP0CTL_MPL_64;
            break;

          default:
            uerr("Unsupported maxpacket: %d\n", maxpacket);
            return -EINVAL;
        }
    }

  /* For other endpoints, the packet size is in bytes */

  else
    {
      mpsiz = (maxpacket << USBFS_DIEPCTL_MPL_SHIFT);
    }

  /* If the endpoint is already active don't change the endpoint control
   * register.
   */

  regaddr = GD32_USBFS_DIEPCTL(privep->epphy);
  regval  = gd32_getreg(regaddr);
  if ((regval & USBFS_DIEPCTL_EPACT) == 0)
    {
      if (regval & USBFS_DIEPCTL_NAKS)
        {
          regval |= USBFS_DIEPCTL_CNAK;
        }

      regval &= ~(USBFS_DIEPCTL_MPL_MASK | USBFS_DIEPCTL_EPTYPE_MASK |
                  USBFS_DIEPCTL_TXFNUM_MASK);
      regval |= mpsiz;
      regval |= (eptype << USBFS_DIEPCTL_EPTYPE_SHIFT);
      regval |= (privep->epphy << USBFS_DIEPCTL_TXFNUM_SHIFT);
      regval |= (USBFS_DIEPCTL_SD0PID | USBFS_DIEPCTL_EPACT);
      gd32_putreg(regval, regaddr);

      /* Save the endpoint configuration */

