GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfsdev.c
      privep->ep.maxpacket = maxpacket;
      privep->eptype       = eptype;
      privep->stalled      = false;
    }

  /* Enable the interrupt for this endpoint */

  regval = gd32_getreg(GD32_USBFS_DAEPINTEN);
  regval |= USBFS_DAEPINT_IEP(privep->epphy);
  gd32_putreg(regval, GD32_USBFS_DAEPINTEN);

  return OK;
}

/****************************************************************************
 * Name: gd32_ep_configure
 *
 * Description:
 *   Configure endpoint, making it usable
 *
 * Input Parameters:
 *   ep   - the struct usbdev_ep_s instance obtained from allocep()
 *   desc - A struct usb_epdesc_s instance describing the endpoint
 *   last - true if this this last endpoint to be configured.  Some hardware
 *          needs to take special action when all of the endpoints have been
 *          configured.
 *
 ****************************************************************************/

static int gd32_ep_configure(struct usbdev_ep_s *ep,
                                const struct usb_epdesc_s *desc,
                                bool last)
{
  struct gd32_ep_s *privep = (struct gd32_ep_s *)ep;
  uint16_t maxpacket;
  uint8_t  eptype;
  int ret;

  usbtrace(TRACE_EPCONFIGURE, privep->epphy);
  DEBUGASSERT(desc->addr == ep->eplog);

  /* Initialize EP capabilities */

  maxpacket = GETUINT16(desc->mxpacketsize);
  eptype    = desc->attr & USB_EP_ATTR_XFERTYPE_MASK;

  /* Setup Endpoint Control Register */

  if (privep->isin)
    {
      ret = gd32_epin_configure(privep, eptype, maxpacket);
    }
  else
    {
      ret = gd32_epout_configure(privep, eptype, maxpacket);
    }

  return ret;
}

/****************************************************************************
 * Name: gd32_ep0_configure
 *
 * Description:
 *   Reset Usb engine
 *
 ****************************************************************************/

static void gd32_ep0_configure(struct gd32_usbdev_s *priv)
{
  /* Enable EP0 IN and OUT */

  gd32_epin_configure(&priv->epin[EP0], USB_EP_ATTR_XFER_CONTROL,
                      CONFIG_USBDEV_EP0_MAXSIZE);
  gd32_epout_configure(&priv->epout[EP0], USB_EP_ATTR_XFER_CONTROL,
                       CONFIG_USBDEV_EP0_MAXSIZE);
}

/****************************************************************************
 * Name: gd32_epout_disable
 *
 * Description:
 *   Disable an OUT endpoint will no longer be used
 *
 ****************************************************************************/

static void gd32_epout_disable(struct gd32_ep_s *privep)
{
  uint32_t regaddr;
  uint32_t regval;
  irqstate_t flags;

  usbtrace(TRACE_EPDISABLE, privep->epphy);

  /* Is this an IN or an OUT endpoint */

  /* Before disabling any OUT endpoint, the application must enable
   * Global OUT NAK mode in the core.
   */

  flags = enter_critical_section();
  gd32_enablegonak(privep);

  /* Disable the required OUT endpoint by setting the EPDIS and SNAK bits
   * int DOECPTL register.
   */

  regaddr = GD32_USBFS_DOEPCTL(privep->epphy);
  regval  = gd32_getreg(regaddr);
  regval &= ~USBFS_DOEPCTL_EPEN;
  regval |= (USBFS_DOEPCTL_EPD | USBFS_DOEPCTL_SNAK);
  gd32_putreg(regval, regaddr);

  /* Wait for the EPDISD interrupt which indicates that the OUT
   * endpoint is completely disabled.
   */

  up_udelay(10);

  /* Clear the EPDISD interrupt indication */

  gd32_putreg(USBFS_DOEPINTF_EPDIS, GD32_USBFS_DOEPINTF(privep->epphy));

  /* Then disable the Global OUT NAK mode to continue receiving data
   * from other non-disabled OUT endpoints.
   */

  gd32_disablegonak(privep);

  /* Disable endpoint interrupts */

  regval  = gd32_getreg(GD32_USBFS_DAEPINTEN);
  regval &= ~USBFS_DAEPINT_OEP(privep->epphy);
  gd32_putreg(regval, GD32_USBFS_DAEPINTEN);

  /* Cancel any queued read requests */

  gd32_req_cancel(privep, -ESHUTDOWN);

  leave_critical_section(flags);
}

/****************************************************************************
 * Name: gd32_epin_disable
 *
 * Description:
 *   Disable an IN endpoint when it will no longer be used
 *
 ****************************************************************************/

static void gd32_epin_disable(struct gd32_ep_s *privep)
{
  uint32_t regaddr;
  uint32_t regval;
  irqstate_t flags;

  usbtrace(TRACE_EPDISABLE, privep->epphy);

  /* After USB reset, the endpoint will already be deactivated by the
   * hardware. Trying to disable again will just hang in the wait.
   */

  regaddr = GD32_USBFS_DIEPCTL(privep->epphy);
  regval  = gd32_getreg(regaddr);
  if ((regval & USBFS_DIEPCTL_EPEN) == 0)
    {
      return;
    }

  /* Deactivate and disable the endpoint by setting the EPDIS and SNAK bits
   * the DIEPCTLx register.
   */

  flags = enter_critical_section();
  regaddr = GD32_USBFS_DIEPCTL(privep->epphy);
  regval  = gd32_getreg(regaddr);
  regval &= ~USBFS_DIEPCTL_EPEN;
  regval |= (USBFS_DIEPCTL_EPD | USBFS_DIEPCTL_SNAK);
  gd32_putreg(regval, regaddr);

  /* Wait for the EPDISD interrupt which indicates that the IN
   * endpoint is completely disabled.
   */

  /* Use a delay to wait for the endpoint to be disabled,
   * matching the approach used for OUT endpoints.
   */

  up_udelay(10);

  /* Clear the EPDISD interrupt indication */

  gd32_putreg(USBFS_DIEPINTF_EPDIS, regaddr);

  /* Flush any data remaining in the TxFIFO */

  gd32_txfifo_flush(USBFS_GRSTCTL_TXFNUM_D(privep->epphy));

  /* Disable endpoint interrupts */

  regval  = gd32_getreg(GD32_USBFS_DAEPINTEN);
  regval &= ~USBFS_DAEPINT_IEP(privep->epphy);
  gd32_putreg(regval, GD32_USBFS_DAEPINTEN);

  /* Cancel any queued write requests */

  gd32_req_cancel(privep, -ESHUTDOWN);
  leave_critical_section(flags);
}

/****************************************************************************
 * Name: gd32_ep_disable
 *
 * Description:
 *   The endpoint will no longer be used
 *
 ****************************************************************************/

static int gd32_ep_disable(struct usbdev_ep_s *ep)
{
  struct gd32_ep_s *privep = (struct gd32_ep_s *)ep;

#ifdef CONFIG_DEBUG_FEATURES
  if (!ep)
    {
      usbtrace(TRACE_DEVERROR(GD32_TRACEERR_INVALIDPARMS), 0);
      return -EINVAL;
    }
#endif

  usbtrace(TRACE_EPDISABLE, privep->epphy);

  /* Is this an IN or an OUT endpoint */

  if (privep->isin)
    {
      /* Disable the IN endpoint */

      gd32_epin_disable(privep);
    }
  else
    {
      /* Disable the OUT endpoint */

      gd32_epout_disable(privep);
    }

  return OK;
}

/****************************************************************************
 * Name: gd32_ep_allocreq
 *
 * Description:
 *   Allocate an I/O request
 *
 ****************************************************************************/

static struct usbdev_req_s *gd32_ep_allocreq(struct usbdev_ep_s *ep)
{
  struct gd32_req_s *privreq;

#ifdef CONFIG_DEBUG_FEATURES
  if (!ep)
    {
      usbtrace(TRACE_DEVERROR(GD32_TRACEERR_INVALIDPARMS), 0);
      return NULL;
    }
#endif

  usbtrace(TRACE_EPALLOCREQ, ((struct gd32_ep_s *)ep)->epphy);

  privreq = (struct gd32_req_s *)
                   kmm_malloc(sizeof(struct gd32_req_s));
  if (!privreq)
    {
      usbtrace(TRACE_DEVERROR(GD32_TRACEERR_ALLOCFAIL), 0);
      return NULL;
    }

  memset(privreq, 0, sizeof(struct gd32_req_s));
  return &privreq->req;
}

/****************************************************************************
 * Name: gd32_ep_freereq
 *
 * Description:
 *   Free an I/O request
 *
 ****************************************************************************/

static void gd32_ep_freereq(struct usbdev_ep_s *ep,
                               struct usbdev_req_s *req)
{
  struct gd32_req_s *privreq = (struct gd32_req_s *)req;

#ifdef CONFIG_DEBUG_FEATURES
  if (!ep || !req)
    {
      usbtrace(TRACE_DEVERROR(GD32_TRACEERR_INVALIDPARMS), 0);
      return;
    }
#endif

  usbtrace(TRACE_EPFREEREQ, ((struct gd32_ep_s *)ep)->epphy);
  kmm_free(privreq);
}

/****************************************************************************
 * Name: gd32_ep_allocbuffer
 *
 * Description:
 *   Allocate an I/O buffer
 *
 ****************************************************************************/

#ifdef CONFIG_USBDEV_DMA
static void *gd32_ep_allocbuffer(struct usbdev_ep_s *ep,
                                    uint16_t bytes)
{
  usbtrace(TRACE_EPALLOCBUFFER, ((struct gd32_ep_s *)ep)->epphy);

