GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfsdev.c
  usbtrace(TRACE_DEVGETFRAME, 0);

  /* Return the last frame number of the last SOF detected by the hardware */

  regval = gd32_getreg(GD32_USBFS_DSTAT);
  return (int)((regval & USBFS_DSTAT_FNRSOF_MASK) >>
               USBFS_DSTAT_FNRSOF_SHIFT);
}

/****************************************************************************
 * Name: gd32_wakeup
 *
 * Description:
 *   Exit suspend mode.
 *
 ****************************************************************************/

static int gd32_wakeup(struct usbdev_s *dev)
{
  struct gd32_usbdev_s *priv = (struct gd32_usbdev_s *)dev;
  uint32_t regval;
  irqstate_t flags;

  usbtrace(TRACE_DEVWAKEUP, 0);

  /* Is wakeup enabled? */

  flags = enter_critical_section();
  if (priv->wakeup)
    {
      /* Yes... is the core suspended? */

      regval = gd32_getreg(GD32_USBFS_DSTAT);
      if ((regval & USBFS_DSTAT_SPST) != 0)
        {
          /* Re-start the PHY clock and un-gate USB core clock (HCLK) */

#ifdef CONFIG_USBDEV_LOWPOWER
          regval = gd32_getreg(GD32_USBFS_PWRCLKCTL);
          regval &= ~(USBFS_PWRCLKCTL_SUCLK | USBFS_PWRCLKCTL_SHCLK);
          gd32_putreg(regval, GD32_USBFS_PWRCLKCTL);
#endif
          /* Activate Remote wakeup signaling */

          regval  = gd32_getreg(GD32_USBFS_DCTL);
          regval |= USBFS_DCTL_RWKUP;
          gd32_putreg(regval, GD32_USBFS_DCTL);
          up_mdelay(5);
          regval &= ~USBFS_DCTL_RWKUP;
          gd32_putreg(regval, GD32_USBFS_DCTL);
        }
    }

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: gd32_selfpowered
 *
 * Description:
 *   Sets/clears the device self-powered feature
 *
 ****************************************************************************/

static int gd32_selfpowered(struct usbdev_s *dev, bool selfpowered)
{
  struct gd32_usbdev_s *priv = (struct gd32_usbdev_s *)dev;

  usbtrace(TRACE_DEVSELFPOWERED, (uint16_t)selfpowered);

#ifdef CONFIG_DEBUG_FEATURES
  if (!dev)
    {
      usbtrace(TRACE_DEVERROR(GD32_TRACEERR_INVALIDPARMS), 0);
      return -ENODEV;
    }
#endif

  priv->selfpowered = selfpowered;
  return OK;
}

/****************************************************************************
 * Name: gd32_pullup
 *
 * Description:
 *   Software-controlled connect to/disconnect from USB host
 *
 ****************************************************************************/

static int gd32_pullup(struct usbdev_s *dev, bool enable)
{
  uint32_t regval;

  usbtrace(TRACE_DEVPULLUP, (uint16_t)enable);

  irqstate_t flags = enter_critical_section();
  regval = gd32_getreg(GD32_USBFS_DCTL);
  if (enable)
    {
      /* Connect the device by clearing the soft disconnect bit in the DCTL
       * register
       */

      regval &= ~USBFS_DCTL_SD;
    }
  else
    {
      /* Disconnect the device by setting the soft disconnect bit in the DCTL
       * register
       */

      regval |= USBFS_DCTL_SD;
    }

  gd32_putreg(regval, GD32_USBFS_DCTL);
  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: gd32_setaddress
 *
 * Description:
 *   Set the devices USB address
 *
 ****************************************************************************/

static void gd32_setaddress(struct gd32_usbdev_s *priv,
                               uint16_t address)
{
  uint32_t regval;

  /* Set the device address in the DCFG register */

  regval = gd32_getreg(GD32_USBFS_DCFG);
  regval &= ~USBFS_DCFG_DAR_MASK;
  regval |= ((uint32_t)address << USBFS_DCFG_DAR_SHIFT);
  gd32_putreg(regval, GD32_USBFS_DCFG);

  /* Are we now addressed?  (i.e., do we have a non-NULL device
   * address?)
   */

  if (address != 0)
    {
      priv->devstate  = DEVSTATE_ADDRESSED;
      priv->addressed = true;
    }
  else
    {
      priv->devstate  = DEVSTATE_DEFAULT;
      priv->addressed = false;
    }
}

/****************************************************************************
 * Name: gd32_txfifo_flush
 *
 * Description:
 *   Flush the specific TX fifo.
 *
 ****************************************************************************/

static int gd32_txfifo_flush(uint32_t txfnum)
{
  uint32_t regval;
  uint32_t timeout;

  /* Initiate the TX FIFO flush operation */

  regval = USBFS_GRSTCTL_TXFF | txfnum;
  gd32_putreg(regval, GD32_USBFS_GRSTCTL);

  /* Wait for the FLUSH to complete */

  for (timeout = 0; timeout < GD32_FLUSH_DELAY; timeout++)
    {
      regval = gd32_getreg(GD32_USBFS_GRSTCTL);
      if ((regval & USBFS_GRSTCTL_TXFF) == 0)
        {
          break;
        }
    }

  if (timeout >= GD32_FLUSH_DELAY)
    {
      uerr("ERROR: TxFIFO flush timeout\n");
    }

  /* Wait for 3 PHY Clocks */

  up_udelay(3);
  return OK;
}

/****************************************************************************
 * Name: gd32_rxfifo_flush
 *
 * Description:
 *   Flush the RX fifo.
 *
 ****************************************************************************/

static int gd32_rxfifo_flush(void)
{
  uint32_t regval;
  uint32_t timeout;

  /* Initiate the RX FIFO flush operation */

  gd32_putreg(USBFS_GRSTCTL_RXFF, GD32_USBFS_GRSTCTL);

  /* Wait for the FLUSH to complete */

  for (timeout = 0; timeout < GD32_FLUSH_DELAY; timeout++)
    {
      regval = gd32_getreg(GD32_USBFS_GRSTCTL);
      if ((regval & USBFS_GRSTCTL_RXFF) == 0)
        {
          break;
        }
    }

  if (timeout >= GD32_FLUSH_DELAY)
    {
      uerr("ERROR: RxFIFO flush timeout\n");
    }

  /* Wait for 3 PHY Clocks */

  up_udelay(3);
  return OK;
}

/****************************************************************************
 * Name: gd32_swinitialize
 *
 * Description:
 *   Initialize all driver data structures.
 *
 ****************************************************************************/

static void gd32_swinitialize(struct gd32_usbdev_s *priv)
{
  struct gd32_ep_s *privep;
  int i;

  /* Initialize the device state structure */

  memset(priv, 0, sizeof(struct gd32_usbdev_s));

  priv->usbdev.ops = &g_devops;
  priv->usbdev.ep0 = &priv->epin[EP0].ep;

