GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfsdev.c
  priv->epavail[0] = GD32_EP_AVAILABLE;
  priv->epavail[1] = GD32_EP_AVAILABLE;

  /* Initialize the IN endpoint list */

  for (i = 0; i < GD32_NENDPOINTS; i++)
    {
      /* Set endpoint operations, reference to driver structure (not
       * really necessary because there is only one controller), and
       * the physical endpoint number (which is just the index to the
       * endpoint).
       */

      privep           = &priv->epin[i];
      privep->ep.ops   = &g_epops;
      privep->dev      = priv;
      privep->isin     = 1;

      /* The index, i, is the physical endpoint address;  Map this
       * to a logical endpoint address usable by the class driver.
       */

      privep->epphy    = i;
      privep->ep.eplog = GD32_EPPHYIN2LOG(i);

      /* Control until endpoint is activated */

      privep->eptype       = USB_EP_ATTR_XFER_CONTROL;
      privep->ep.maxpacket = CONFIG_USBDEV_EP0_MAXSIZE;
    }

  /* Initialize the OUT endpoint list */

  for (i = 0; i < GD32_NENDPOINTS; i++)
    {
      /* Set endpoint operations, reference to driver structure (not
       * really necessary because there is only one controller), and
       * the physical endpoint number (which is just the index to the
       * endpoint).
       */

      privep           = &priv->epout[i];
      privep->ep.ops   = &g_epops;
      privep->dev      = priv;

      /* The index, i, is the physical endpoint address;  Map this
       * to a logical endpoint address usable by the class driver.
       */

      privep->epphy    = i;
      privep->ep.eplog = GD32_EPPHYOUT2LOG(i);

      /* Control until endpoint is activated */

      privep->eptype       = USB_EP_ATTR_XFER_CONTROL;
      privep->ep.maxpacket = CONFIG_USBDEV_EP0_MAXSIZE;
    }
}

/****************************************************************************
 * Name: gd32_hwinitialize
 *
 * Description:
 *   Configure the USBFS core for operation.
 *
 ****************************************************************************/

static void gd32_hwinitialize(struct gd32_usbdev_s *priv)
{
  uint32_t regval;
  uint32_t timeout;
  uint32_t address;
  int i;

  /* Enable Vbus monitoring in the Power control */

  /* Configure USBFS 48MHz clock prescaler */

  regval = getreg32(GD32_RCU_CFG0);
  regval &= ~RCU_CFG0_USBFSPSC_MASK;
  regval |= GD32_USBFSPSC_VALUE;
  putreg32(regval, GD32_RCU_CFG0);

  /* Enable USBFS peripheral clock (AHBEN bit 12) */

  regval = getreg32(GD32_RCU_AHBEN);
  regval |= RCU_AHBEN_USBFSEN;
  putreg32(regval, GD32_RCU_AHBEN);

  /* At start-up the core is in FS mode. */

  /* Disable global interrupts by clearing the GINTMASK bit in the GAHBCFG
   * register; Set the TXFELVL bit in the GAHBCFG register so that TxFIFO
   * interrupts will occur when the TxFIFO is truly empty
   * (not just half full).
   */

  gd32_putreg(USBFS_GAHBCS_TXFTH, GD32_USBFS_GAHBCS);

  /* Common USB OTG core initialization */

  /* Perform the core soft reset. */

  gd32_putreg(USBFS_GRSTCTL_CSRST, GD32_USBFS_GRSTCTL);
  for (timeout = 0; timeout < GD32_READY_DELAY; timeout++)
    {
      regval = gd32_getreg(GD32_USBFS_GRSTCTL);
      if ((regval & USBFS_GRSTCTL_CSRST) == 0)
        {
          break;
        }
    }

  /* Wait for 3 PHY Clocks */

  up_udelay(3);

  /* After core reset all registers return to defaults, including DCTL.
   * DCTL_SD defaults to 0 (connected). Force soft disconnect here so the
   * device stays off the bus until usbdev_register() explicitly connects.
   */

  regval  = gd32_getreg(GD32_USBFS_DCTL);
  regval |= USBFS_DCTL_SD;
  gd32_putreg(regval, GD32_USBFS_DCTL);

  /* Deactivate the power down */

  regval  = USBFS_GCCFG_PWRON | USBFS_GCCFG_VBUSACEN |
            USBFS_GCCFG_VBUSBCEN;
#ifndef CONFIG_USBDEV_VBUSSENSING
  regval |= USBFS_GCCFG_VBUSIG;
#endif

  gd32_putreg(regval, GD32_USBFS_GCCFG);
  up_mdelay(20);

  /* Force Device Mode */

  regval  = gd32_getreg(GD32_USBFS_GUSBCS);
  regval &= ~USBFS_GUSBCS_FHM;
  regval |= USBFS_GUSBCS_FDM;
  gd32_putreg(regval, GD32_USBFS_GUSBCS);
  up_mdelay(50);

  /* Initialize device mode */

  /* Restart the PHY Clock */

  gd32_putreg(0, GD32_USBFS_PWRCLKCTL);

  /* Device configuration register */

  regval = gd32_getreg(GD32_USBFS_DCFG);
  regval &= ~USBFS_DCFG_EOPFT_MASK;
  regval |= USBFS_DCFG_EOPFT_80PCT;
  gd32_putreg(regval, GD32_USBFS_DCFG);

  /* Set full speed PHY */

  regval = gd32_getreg(GD32_USBFS_DCFG);
  regval &= ~USBFS_DCFG_DS_MASK;
  regval |= USBFS_DCFG_DS_FS;
  gd32_putreg(regval, GD32_USBFS_DCFG);

  /* Set Rx FIFO size */

  gd32_putreg(GD32_RXFIFO_WORDS, GD32_USBFS_GRFLEN);

#if GD32_NENDPOINTS > 0
  /* EP0 TX */

  address = GD32_RXFIFO_WORDS;
  regval  = (address << USBFS_DIEP0TFLEN_IEP0TXRSAR_SHIFT) |
            (GD32_EP0_TXFIFO_WORDS << USBFS_DIEP0TFLEN_IEP0TXFD_SHIFT);
  gd32_putreg(regval, GD32_USBFS_DIEP0TFLEN);
#endif

#if GD32_NENDPOINTS > 1
  /* EP1 TX */

  address += GD32_EP0_TXFIFO_WORDS;
  regval   = address | (GD32_EP1_TXFIFO_WORDS << 16);
  gd32_putreg(regval, GD32_USBFS_DIEP1TFLEN);
#endif

#if GD32_NENDPOINTS > 2
  /* EP2 TX */

  address += GD32_EP1_TXFIFO_WORDS;
  regval   = address | (GD32_EP2_TXFIFO_WORDS << 16);
  gd32_putreg(regval, GD32_USBFS_DIEP2TFLEN);
#endif

#if GD32_NENDPOINTS > 3
  /* EP3 TX */

  address += GD32_EP2_TXFIFO_WORDS;
  regval   = address | (GD32_EP3_TXFIFO_WORDS << 16);
  gd32_putreg(regval, GD32_USBFS_DIEP3TFLEN);
#endif

  /* Flush the FIFOs */

  gd32_txfifo_flush(USBFS_GRSTCTL_TXFNUM_DALL);
  gd32_rxfifo_flush();

  /* Clear all pending Device Interrupts */

  gd32_putreg(0, GD32_USBFS_DIEPINTEN);
  gd32_putreg(0, GD32_USBFS_DOEPINTEN);
  gd32_putreg(0, GD32_USBFS_DIEPFEINTEN);
  gd32_putreg(0xffffffff, GD32_USBFS_DAEPINT);
  gd32_putreg(0, GD32_USBFS_DAEPINTEN);

  /* Configure all IN endpoints */

  for (i = 0; i < GD32_NENDPOINTS; i++)
    {
      regval = gd32_getreg(GD32_USBFS_DIEPCTL(i));
      if ((regval & USBFS_DIEPCTL_EPEN) != 0)
        {
          /* The endpoint is already enabled */

          regval = USBFS_DIEPCTL_EPEN | USBFS_DIEPCTL_SNAK;
        }
      else
        {
          regval = 0;
        }

