GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfsdev.c
      gd32_putreg(regval, GD32_USBFS_DIEPCTL(i));
      gd32_putreg(0, GD32_USBFS_DIEPLEN(i));
      gd32_putreg(0xff, GD32_USBFS_DIEPINTF(i));
    }

  /* Configure all OUT endpoints */

  for (i = 0; i < GD32_NENDPOINTS; i++)
    {
      regval = gd32_getreg(GD32_USBFS_DOEPCTL(i));
      if ((regval & USBFS_DOEPCTL_EPEN) != 0)
        {
          /* The endpoint is already enabled */

          regval = USBFS_DOEPCTL_EPEN | USBFS_DOEPCTL_SNAK;
        }
      else
        {
          regval = 0;
        }

      gd32_putreg(regval, GD32_USBFS_DOEPCTL(i));
      gd32_putreg(0, GD32_USBFS_DOEPLEN(i));
      gd32_putreg(0xff, GD32_USBFS_DOEPINTF(i));
    }

  /* Disable all interrupts. */

  gd32_putreg(0, GD32_USBFS_GINTEN);

  /* Clear any pending USB_OTG Interrupts */

  gd32_putreg(0xffffffff, GD32_USBFS_GOTGINTF);

  /* Clear any pending interrupts */

  regval = gd32_getreg(GD32_USBFS_GINTF);
  regval &=  USBFS_GINTF_RESERVED;
  gd32_putreg(regval | USBFS_GINTF_RC_W1, GD32_USBFS_GINTF);

  /* Enable the interrupts in the INTMSK */

  regval = (USBFS_GINTF_RXFNEIF | USBFS_GINTF_SP | USBFS_GINTF_ENUMF |
            USBFS_GINTF_IEPIF | USBFS_GINTF_OEPIF | USBFS_GINTF_RST);

#ifdef CONFIG_USBDEV_ISOCHRONOUS
  regval |= (USBFS_GINTF_ISOINCIF | USBFS_GINTF_PXNCIF_ISOONCIF);
#endif

#ifdef CONFIG_USBDEV_SOFINTERRUPT
  regval |= USBFS_GINTF_SOF;
#endif

#ifdef CONFIG_USBDEV_VBUSSENSING
  regval |= (USBFS_GINTF_OTGIF | USBFS_GINTF_SESIF);
#endif

#ifdef CONFIG_DEBUG_FEATURES
  regval |= USBFS_GINTF_MFIF;
#endif

  gd32_putreg(regval, GD32_USBFS_GINTEN);

  /* Enable the USB global interrupt by setting GINTMSK in the global OTG
   * FS AHB configuration register; Set the TXFELVL bit in the GAHBCFG
   * register so that TxFIFO interrupts will occur when the TxFIFO is truly
   * empty (not just half full).
   */

  gd32_putreg(USBFS_GAHBCS_GINTEN | USBFS_GAHBCS_TXFTH,
               GD32_USBFS_GAHBCS);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: arm_usbinitialize
 *
 * Description:
 *   Initialize USB hardware.
 *
 * Assumptions:
 * - This function is called very early in the initialization sequence
 * - PLL and GIO pin initialization is not performed here but should been in
 *   the low-level  boot logic:  PLL1 must be configured for operation at
 *   48MHz and P0.23 and PO.31 in PINSEL1 must be configured for Vbus and USB
 *   connect LED.
 *
 ****************************************************************************/

void arm_usbinitialize(void)
{
  /* At present, there is only a single USBFS device support. Hence it is
   * pre-allocated as g_usbfsdev.  However, in most code, the private data
   * structure will be referenced using the 'priv' pointer (rather than the
   * global data) in order to simplify any future support for multiple
   * devices.
   */

  struct gd32_usbdev_s *priv = &g_usbfsdev;
  int ret;

  usbtrace(TRACE_DEVINIT, 0);

  /* Here we assume that:
   *
   * 1. GPIOA and USBFS peripheral clocking has already been enabled as part
   *    of the boot sequence.
   * 2. Board-specific logic has already enabled other board specific GPIOs
   *    for things like soft pull-up, VBUS sensing, power controls, and over-
   *    current detection.
   */

  /* Configure USBFS alternate function pins
   *
   * PIN* SIGNAL      DIRECTION
   * ---- ----------- ----------
   * PA8  USBFS_SOF  SOF clock output
   * PA9  USBFS_VBUS VBUS input for device, Driven by external regulator by
   *                  host (not an alternate function)
   * PA10 USBFS_ID   OTG ID pin (only needed in Dual mode)
   * PA11 USBFS_DM   D- I/O
   * PA12 USBFS_DP   D+ I/O
   *
   * *Pins may vary from device-to-device.
   */

  gd32_gpio_config(GPIO_USBFS_DM);
  gd32_gpio_config(GPIO_USBFS_DP);
  gd32_gpio_config(GPIO_USBFS_ID);    /* Only needed for OTG */

  /* SOF output pin configuration is configurable. */

#ifdef CONFIG_GD32E11X_USBFS_SOFOUTPUT
  gd32_gpio_config(GPIO_USBFS_SOF);
#endif

  /* Uninitialize the hardware so that we know that we are starting from a
   * known state.
   */

  arm_usbuninitialize();

  /* Initialize the driver data structure */

  gd32_swinitialize(priv);

  /* Attach the USBFS interrupt handler */

  ret = irq_attach(GD32_IRQ_USBFS, gd32_usbinterrupt, NULL);
  if (ret < 0)
    {
      uerr("ERROR: irq_attach failed: %d\n", ret);
      goto errout;
    }

  /* Initialize the USB OTG core */

  gd32_hwinitialize(priv);

  /* Reset/Re-initialize the USB hardware */

  gd32_usbreset(priv);

  /* Enable USB controller interrupts at the NVIC */

  up_enable_irq(GD32_IRQ_USBFS);
  return;

errout:
  arm_usbuninitialize();
}

/****************************************************************************
 * Name: arm_usbuninitialize
 ****************************************************************************/

void arm_usbuninitialize(void)
{
  /* At present, there is only a single USBFS device support. Hence it is
   * pre-allocated as g_usbfsdev.  However, in most code, the private data
   * structure will be referenced using the 'priv' pointer (rather than the
   * global data) in order to simplify any future support for multiple
   * devices.
   */

  struct gd32_usbdev_s *priv = &g_usbfsdev;
  irqstate_t flags;
  bool disconnected = false;
  int i;

  usbtrace(TRACE_DEVUNINIT, 0);

  if (priv->driver)
    {
      usbtrace(TRACE_DEVERROR(GD32_TRACEERR_DRIVERREGISTERED), 0);
      usbdev_unregister(priv->driver);
      disconnected = true;
    }

  /* Disconnect device */

  flags = enter_critical_section();
  if (!disconnected)
    {
      gd32_pullup(&priv->usbdev, false);
    }

  priv->usbdev.speed = USB_SPEED_UNKNOWN;

  /* Disable and detach IRQs */

  up_disable_irq(GD32_IRQ_USBFS);
  irq_detach(GD32_IRQ_USBFS);

  /* Disable all endpoint interrupts */

