GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfsdev.c
  for (i = 0; i < GD32_NENDPOINTS; i++)
    {
      gd32_putreg(0xff, GD32_USBFS_DIEPINTF(i));
      gd32_putreg(0xff, GD32_USBFS_DOEPINTF(i));
    }

  gd32_putreg(0, GD32_USBFS_DIEPINTEN);
  gd32_putreg(0, GD32_USBFS_DOEPINTEN);
  gd32_putreg(0, GD32_USBFS_DIEPFEINTEN);
  gd32_putreg(0, GD32_USBFS_DAEPINTEN);
  gd32_putreg(0xffffffff, GD32_USBFS_DAEPINT);

  /* Flush the FIFOs */

  gd32_txfifo_flush(USBFS_GRSTCTL_TXFNUM_DALL);
  gd32_rxfifo_flush();

  /* Turn off USB power and clocking */

  priv->devstate = DEVSTATE_DEFAULT;
  leave_critical_section(flags);
}

/****************************************************************************
 * Name: usbdev_register
 *
 * Description:
 *   Register a USB device class driver. The class driver's bind() method
 *   will be called to bind it to a USB device driver.
 *
 ****************************************************************************/

int usbdev_register(struct usbdevclass_driver_s *driver)
{
  /* At present, there is only a single USBFS device support. Hence it is
   * pre-allocated as g_usbfsdev.  However, in most code, the private data
   * structure will be referenced using the 'priv' pointer (rather than the
   * global data) in order to simplify any future support for multiple
   * devices.
   */

  struct gd32_usbdev_s *priv = &g_usbfsdev;
  int ret;

  usbtrace(TRACE_DEVREGISTER, 0);

#ifdef CONFIG_DEBUG_FEATURES
  if (!driver || !driver->ops->bind || !driver->ops->unbind ||
      !driver->ops->disconnect || !driver->ops->setup)
    {
      usbtrace(TRACE_DEVERROR(GD32_TRACEERR_INVALIDPARMS), 0);
      return -EINVAL;
    }

  if (priv->driver)
    {
      usbtrace(TRACE_DEVERROR(GD32_TRACEERR_DRIVER), 0);
      return -EBUSY;
    }
#endif

  /* First hook up the driver */

  priv->driver = driver;

  /* Then bind the class driver */

  ret = CLASS_BIND(driver, &priv->usbdev);
  if (ret)
    {
      usbtrace(TRACE_DEVERROR(GD32_TRACEERR_BINDFAILED), (uint16_t)-ret);
      priv->driver = NULL;
    }
  else
    {
      /* Enable USB controller interrupts */

      up_enable_irq(GD32_IRQ_USBFS);

      /* Nothing seems to call DEV_CONNECT(), but we need to set
       * the RS bit to enable the controller.  It kind of makes sense
       * to do this after the class has bound to us...
       * This bug is really in the class driver.  It should make the
       * soft connect when it is ready to be enumerated.  The logic has been
       * added to the class drivers but is left here as well.
       */

      gd32_pullup(&priv->usbdev, true);
      priv->usbdev.speed = USB_SPEED_FULL;
    }

  return ret;
}

/****************************************************************************
 * Name: usbdev_unregister
 *
 * Description:
 *   Un-register usbdev class driver.If the USB device is connected to a USB
 *   host, it will first disconnect().  The driver is also requested to
 *   unbind() and clean up any device state, before this procedure finally
 *   returns.
 *
 ****************************************************************************/

int usbdev_unregister(struct usbdevclass_driver_s *driver)
{
  /* At present, there is only a single USBFS device support. Hence it is
   * pre-allocated as g_usbfsdev.  However, in most code, the private data
   * structure will be referenced using the 'priv' pointer (rather than the
   * global data) in order to simplify any future support for multiple
   * devices.
   */

  struct gd32_usbdev_s *priv = &g_usbfsdev;
  irqstate_t flags;

  usbtrace(TRACE_DEVUNREGISTER, 0);

#ifdef CONFIG_DEBUG_FEATURES
  if (driver != priv->driver)
    {
      usbtrace(TRACE_DEVERROR(GD32_TRACEERR_INVALIDPARMS), 0);
      return -EINVAL;
    }
#endif

  /* Reset the hardware and cancel all requests.  All requests must be
   * canceled while the class driver is still bound.
   */

  flags = enter_critical_section();
  gd32_usbreset(priv);
  leave_critical_section(flags);

  /* Unbind the class driver */

  CLASS_UNBIND(driver, &priv->usbdev);

  /* Disable USB controller interrupts */

  flags = enter_critical_section();
  up_disable_irq(GD32_IRQ_USBFS);

  /* Disconnect device */

  gd32_pullup(&priv->usbdev, false);

  /* Unhook the driver */

  priv->driver = NULL;
  leave_critical_section(flags);

  return OK;
}

#endif /* CONFIG_USBDEV && CONFIG_GD32E11X_USBFS */